[Killed] BlockStatement
src/binarySearchTree.js:2:24
 class BinarySearchTreeNode {
-    constructor(value) {
-        this._value = value;
-        this._left = null;
-        this._right = null;
-        this._parent = null;
-    }
+    constructor(value) {}
 
     setValue(value) {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/binarySearchTree.js:9:21
         this._parent = null;
     }
 
-    setValue(value) {
-        this._value = value;
-        return this;
-    }
+    setValue(value) {}
 
     getValue() {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with two children
statusReason: expected true to equal false

[Killed] BlockStatement
src/binarySearchTree.js:14:16
         return this;
     }
 
-    getValue() {
-        return this._value;
-    }
+    getValue() {}
 
     setLeft(left) {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/binarySearchTree.js:18:19
         return this._value;
     }
 
-    setLeft(left) {
-        if (left && !(left instanceof BinarySearchTreeNode)) {
-            throw new Error('setLeft expects a BinarySearchTreeNode');
-        }
-
-        this._left = left || null;
-        return this;
-    }
+    setLeft(left) {}
 
     getLeft() {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] LogicalOperator
src/binarySearchTree.js:19:13
     }
 
     setLeft(left) {
-        if (left && !(left instanceof BinarySearchTreeNode)) {
+        if (left || !(left instanceof BinarySearchTreeNode)) {
             throw new Error('setLeft expects a BinarySearchTreeNode');
         }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: setLeft expects a BinarySearchTreeNode

[Killed] ConditionalExpression
src/binarySearchTree.js:19:13
     }
 
     setLeft(left) {
-        if (left && !(left instanceof BinarySearchTreeNode)) {
+        if (false) {
             throw new Error('setLeft expects a BinarySearchTreeNode');
         }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 8 to equal 10

[Killed] LogicalOperator
src/binarySearchTree.js:23:22
             throw new Error('setLeft expects a BinarySearchTreeNode');
         }
 
-        this._left = left || null;
+        this._left = left && null;
         return this;
     }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:23:22
             throw new Error('setLeft expects a BinarySearchTreeNode');
         }
 
-        this._left = left || null;
+        this._left = false;
         return this;
     }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: s[(intermediate value)(intermediate value)(intermediate value)].getValue is not a function

[Killed] BlockStatement
src/binarySearchTree.js:27:15
         return this;
     }
 
-    getLeft() {
-        return this._left;
-    }
+    getLeft() {}
 
     hasLeft() {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:31:15
         return this._left;
     }
 
-    hasLeft() {
-        return this._left instanceof BinarySearchTreeNode;
-    }
+    hasLeft() {}
 
     setRight(right) {
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:35:21
         return this._left instanceof BinarySearchTreeNode;
     }
 
-    setRight(right) {
-        if (right && !(right instanceof BinarySearchTreeNode)) {
-            throw new Error('setRight expects a BinarySearchTreeNode or null');
-        }
-
-        this._right = right || null;
-        return this;
-    }
+    setRight(right) {}
 
     getRight() {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] LogicalOperator
src/binarySearchTree.js:36:13
     }
 
     setRight(right) {
-        if (right && !(right instanceof BinarySearchTreeNode)) {
+        if (right || !(right instanceof BinarySearchTreeNode)) {
             throw new Error('setRight expects a BinarySearchTreeNode or null');
         }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: setRight expects a BinarySearchTreeNode or null

[Killed] ConditionalExpression
src/binarySearchTree.js:36:13
     }
 
     setRight(right) {
-        if (right && !(right instanceof BinarySearchTreeNode)) {
+        if (true) {
             throw new Error('setRight expects a BinarySearchTreeNode or null');
         }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: setRight expects a BinarySearchTreeNode or null

[Killed] ConditionalExpression
src/binarySearchTree.js:40:23
             throw new Error('setRight expects a BinarySearchTreeNode or null');
         }
 
-        this._right = right || null;
+        this._right = true;
         return this;
     }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: s[(intermediate value)(intermediate value)(intermediate value)].getValue is not a function

[Killed] ConditionalExpression
src/binarySearchTree.js:40:23
             throw new Error('setRight expects a BinarySearchTreeNode or null');
         }
 
-        this._right = right || null;
+        this._right = false;
         return this;
     }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: s[(intermediate value)(intermediate value)(intermediate value)].getValue is not a function

[Killed] BlockStatement
src/binarySearchTree.js:44:16
         return this;
     }
 
-    getRight() {
-        return this._right;
-    }
+    getRight() {}
 
     hasRight() {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:48:16
         return this._right;
     }
 
-    hasRight() {
-        return this._right instanceof BinarySearchTreeNode;
-    }
+    hasRight() {}
 
     setParent(parent) {
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:52:23
         return this._right instanceof BinarySearchTreeNode;
     }
 
-    setParent(parent) {
-        if (parent && !(parent instanceof BinarySearchTreeNode)) {
-            throw new Error('setParent expects a BinarySearchTreeNode or null');
-        }
-
-        this._parent = parent || null;
-        return this;
-    }
+    setParent(parent) {}
 
     getParent() {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] ConditionalExpression
src/binarySearchTree.js:53:13
     }
 
     setParent(parent) {
-        if (parent && !(parent instanceof BinarySearchTreeNode)) {
+        if (true) {
             throw new Error('setParent expects a BinarySearchTreeNode or null');
         }
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: setParent expects a BinarySearchTreeNode or null

[Killed] ConditionalExpression
src/binarySearchTree.js:53:13
     }
 
     setParent(parent) {
-        if (parent && !(parent instanceof BinarySearchTreeNode)) {
+        if (false) {
             throw new Error('setParent expects a BinarySearchTreeNode or null');
         }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] ConditionalExpression
src/binarySearchTree.js:57:24
             throw new Error('setParent expects a BinarySearchTreeNode or null');
         }
 
-        this._parent = parent || null;
+        this._parent = false;
         return this;
     }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: temp.getParent(...).getValue is not a function

[Killed] LogicalOperator
src/binarySearchTree.js:57:24
             throw new Error('setParent expects a BinarySearchTreeNode or null');
         }
 
-        this._parent = parent || null;
+        this._parent = parent && null;
         return this;
     }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: temp.getParent(...).getValue is not a function

[Killed] BlockStatement
src/binarySearchTree.js:61:17
         return this;
     }
 
-    getParent() {
-        return this._parent;
-    }
+    getParent() {}
 
     hasParent() {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of undefined (reading 'getValue')

[NoCoverage] BlockStatement
src/binarySearchTree.js:65:17
         return this._parent;
     }
 
-    hasParent() {
-        return this._parent instanceof BinarySearchTreeNode;
-    }
+    hasParent() {}
 
     isRoot() {

[Killed] BlockStatement
src/binarySearchTree.js:69:14
         return this._parent instanceof BinarySearchTreeNode;
     }
 
-    isRoot() {
-        return this._parent === null;
-    }
+    isRoot() {}
 
     isLeaf() {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: temp.getParent(...).getValue is not a function

[Killed] ConditionalExpression
src/binarySearchTree.js:70:16
     }
 
     isRoot() {
-        return this._parent === null;
+        return true;
     }
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] EqualityOperator
src/binarySearchTree.js:70:16
     }
 
     isRoot() {
-        return this._parent === null;
+        return this._parent !== null;
     }
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:73:14
         return this._parent === null;
     }
 
-    isLeaf() {
-        return !this.hasLeft() && !this.hasRight();
-    }
+    isLeaf() {}
 }
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:74:16
     }
 
     isLeaf() {
-        return !this.hasLeft() && !this.hasRight();
+        return false;
     }
 }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BooleanLiteral
src/binarySearchTree.js:74:16
     }
 
     isLeaf() {
-        return !this.hasLeft() && !this.hasRight();
+        return this.hasLeft() && !this.hasRight();
     }
 }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:79:35
 }
 
 class BinarySearchTree {
-    constructor(customComparator) {
-        this._comparator = customComparator || comparator;
-        this._root = null;
-        this._count = 0;
-    }
+    constructor(customComparator) {}
 
     constructPreOrder(pre, size) {
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] LogicalOperator
src/binarySearchTree.js:80:28
 
 class BinarySearchTree {
     constructor(customComparator) {
-        this._comparator = customComparator || comparator;
+        this._comparator = customComparator && comparator;
         this._root = null;
         this._count = 0;
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: this._comparator is not a function

[Killed] ConditionalExpression
src/binarySearchTree.js:80:28
 
 class BinarySearchTree {
     constructor(customComparator) {
-        this._comparator = customComparator || comparator;
+        this._comparator = false;
         this._root = null;
         this._count = 0;
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: this._comparator is not a function

[Killed] BlockStatement
src/binarySearchTree.js:85:34
         this._count = 0;
     }
 
-    constructPreOrder(pre, size) {
-        this._root = new BinarySearchTreeNode(pre[0]);
-        let s = [];
-        s.push(this._root);
-        for (let i = 1; i < size; ++i) {
-            let temp = null;
-            while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
-                temp = s.pop();
-            }
-            if (temp != null) {
-                temp.setRight(new BinarySearchTreeNode(pre[i]));
-                s.push(temp.getRight());
-            } else {
-                temp = s[s.length - 1];
-                temp.setLeft(new BinarySearchTreeNode(pre[i]));
-                s.push(temp.getLeft());
-            }
-        }
-        return this._root;
-    }
+    constructPreOrder(pre, size) {}
 
     insertKey(key) {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:89:40
         this._root = new BinarySearchTreeNode(pre[0]);
         let s = [];
         s.push(this._root);
-        for (let i = 1; i < size; ++i) {
-            let temp = null;
-            while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
-                temp = s.pop();
-            }
-            if (temp != null) {
-                temp.setRight(new BinarySearchTreeNode(pre[i]));
-                s.push(temp.getRight());
-            } else {
-                temp = s[s.length - 1];
-                temp.setLeft(new BinarySearchTreeNode(pre[i]));
-                s.push(temp.getLeft());
-            }
-        }
+        for (let i = 1; i < size; ++i) {}
         return this._root;
     }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:89:25
         this._root = new BinarySearchTreeNode(pre[0]);
         let s = [];
         s.push(this._root);
-        for (let i = 1; i < size; ++i) {
+        for (let i = 1; false; ++i) {
             let temp = null;
             while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:91:20
         s.push(this._root);
         for (let i = 1; i < size; ++i) {
             let temp = null;
-            while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
+            while (s.length >= 0 && pre[i] > s[s.length - 1].getValue()) {
                 temp = s.pop();
             }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:91:20
         s.push(this._root);
         for (let i = 1; i < size; ++i) {
             let temp = null;
-            while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
+            while (true && pre[i] > s[s.length - 1].getValue()) {
                 temp = s.pop();
             }
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:94:17
             while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
                 temp = s.pop();
             }
-            if (temp != null) {
+            if (temp == null) {
                 temp.setRight(new BinarySearchTreeNode(pre[i]));
                 s.push(temp.getRight());
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'setRight')

[Killed] ConditionalExpression
src/binarySearchTree.js:94:17
             while (s.length > 0 && pre[i] > s[s.length - 1].getValue()) {
                 temp = s.pop();
             }
-            if (temp != null) {
+            if (true) {
                 temp.setRight(new BinarySearchTreeNode(pre[i]));
                 s.push(temp.getRight());
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'setRight')

[Killed] BlockStatement
src/binarySearchTree.js:97:20
             if (temp != null) {
                 temp.setRight(new BinarySearchTreeNode(pre[i]));
                 s.push(temp.getRight());
-            } else {
-                temp = s[s.length - 1];
-                temp.setLeft(new BinarySearchTreeNode(pre[i]));
-                s.push(temp.getLeft());
-            }
+            } else {}
         }
         return this._root;
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ArithmeticOperator
src/binarySearchTree.js:98:26
                 temp.setRight(new BinarySearchTreeNode(pre[i]));
                 s.push(temp.getRight());
             } else {
-                temp = s[s.length - 1];
+                temp = s[s.length + 1];
                 temp.setLeft(new BinarySearchTreeNode(pre[i]));
                 s.push(temp.getLeft());
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'setLeft')

[Killed] BlockStatement
src/binarySearchTree.js:108:34
 
     insertKey(key) {
         const temp = new BinarySearchTreeNode(key);
-        const insert = (node) => {
-            const difference = this._comparator(
-                temp.getValue(),
-                node.getValue()
-            );
-            if (difference < 0) {
-                if (node.hasLeft()) {
-                    insert(node.getLeft());
-                } else {
-                    node.setLeft(temp.setParent(node));
-                    this._count += 1;
-                }
-            } else if (difference > 0) {
-                if (node.hasRight()) {
-                    insert(node.getRight());
-                } else {
-                    node.setRight(temp.setParent(node));
-                    this._count += 1;
-                }
-            } else {
-                node.setValue(key);
-            }
-        };
+        const insert = (node) => {};
 
         if (this._root === null) {
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:113:17
                 temp.getValue(),
                 node.getValue()
             );
-            if (difference < 0) {
+            if (difference <= 0) {
                 if (node.hasLeft()) {
                     insert(node.getLeft());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 8 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:113:33
                 temp.getValue(),
                 node.getValue()
             );
-            if (difference < 0) {
-                if (node.hasLeft()) {
-                    insert(node.getLeft());
-                } else {
-                    node.setLeft(temp.setParent(node));
-                    this._count += 1;
-                }
-            } else if (difference > 0) {
+            if (difference < 0) {} else if (difference > 0) {
                 if (node.hasRight()) {
                     insert(node.getRight());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:114:37
                 node.getValue()
             );
             if (difference < 0) {
-                if (node.hasLeft()) {
-                    insert(node.getLeft());
-                } else {
+                if (node.hasLeft()) {} else {
                     node.setLeft(temp.setParent(node));
                     this._count += 1;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:114:21
                 node.getValue()
             );
             if (difference < 0) {
-                if (node.hasLeft()) {
+                if (false) {
                     insert(node.getLeft());
                 } else {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:116:24
             if (difference < 0) {
                 if (node.hasLeft()) {
                     insert(node.getLeft());
-                } else {
-                    node.setLeft(temp.setParent(node));
-                    this._count += 1;
-                }
+                } else {}
             } else if (difference > 0) {
                 if (node.hasRight()) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] AssignmentOperator
src/binarySearchTree.js:118:21
                     insert(node.getLeft());
                 } else {
                     node.setLeft(temp.setParent(node));
-                    this._count += 1;
+                    this._count -= 1;
                 }
             } else if (difference > 0) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:120:40
                     node.setLeft(temp.setParent(node));
                     this._count += 1;
                 }
-            } else if (difference > 0) {
-                if (node.hasRight()) {
-                    insert(node.getRight());
-                } else {
-                    node.setRight(temp.setParent(node));
-                    this._count += 1;
-                }
-            } else {
+            } else if (difference > 0) {} else {
                 node.setValue(key);
             }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 2 to equal 10

[Killed] EqualityOperator
src/binarySearchTree.js:120:24
                     node.setLeft(temp.setParent(node));
                     this._count += 1;
                 }
-            } else if (difference > 0) {
+            } else if (difference >= 0) {
                 if (node.hasRight()) {
                     insert(node.getRight());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 2 to equal 10

[Killed] BlockStatement
src/binarySearchTree.js:121:38
                     this._count += 1;
                 }
             } else if (difference > 0) {
-                if (node.hasRight()) {
-                    insert(node.getRight());
-                } else {
+                if (node.hasRight()) {} else {
                     node.setRight(temp.setParent(node));
                     this._count += 1;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 2 to equal 10

[Killed] ConditionalExpression
src/binarySearchTree.js:121:21
                     this._count += 1;
                 }
             } else if (difference > 0) {
-                if (node.hasRight()) {
+                if (true) {
                     insert(node.getRight());
                 } else {
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:123:24
             } else if (difference > 0) {
                 if (node.hasRight()) {
                     insert(node.getRight());
-                } else {
-                    node.setRight(temp.setParent(node));
-                    this._count += 1;
-                }
+                } else {}
             } else {
                 node.setValue(key);
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 2 to equal 10

[Killed] AssignmentOperator
src/binarySearchTree.js:125:21
                     insert(node.getRight());
                 } else {
                     node.setRight(temp.setParent(node));
-                    this._count += 1;
+                    this._count -= 1;
                 }
             } else {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 2 to equal 10

[Survived] BlockStatement
src/binarySearchTree.js:127:20
                     node.setRight(temp.setParent(node));
                     this._count += 1;
                 }
-            } else {
-                node.setValue(key);
-            }
+            } else {}
         };
 

[Killed] EqualityOperator
src/binarySearchTree.js:132:13
             }
         };
 
-        if (this._root === null) {
+        if (this._root !== null) {
             this._root = temp;
             this._count += 1;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:132:13
             }
         };
 
-        if (this._root === null) {
+        if (false) {
             this._root = temp;
             this._count += 1;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Survived] AssignmentOperator
src/binarySearchTree.js:134:13
 
         if (this._root === null) {
             this._root = temp;
-            this._count += 1;
+            this._count -= 1;
         } else {
             insert(this._root);

[Killed] BlockStatement
src/binarySearchTree.js:135:16
         if (this._root === null) {
             this._root = temp;
             this._count += 1;
-        } else {
-            insert(this._root);
-        }
+        } else {}
 
         return this;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:142:24
         return this;
     }
 
-    containsKey(value) {
-        const contains = (current) => {
-            if (current === null) return false;
-
-            const difference = this._comparator(value, current.getValue());
-            if (difference === 0) return true;
-            if (difference < 0) return contains(current.getLeft());
-            return contains(current.getRight());
-        };
-
-        return contains(this._root);
-    }
+    containsKey(value) {}
 
     treeHeight(node = this._root) {
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected undefined to equal true

[Killed] BlockStatement
src/binarySearchTree.js:143:39
     }
 
     containsKey(value) {
-        const contains = (current) => {
-            if (current === null) return false;
-
-            const difference = this._comparator(value, current.getValue());
-            if (difference === 0) return true;
-            if (difference < 0) return contains(current.getLeft());
-            return contains(current.getRight());
-        };
+        const contains = (current) => {};
 
         return contains(this._root);
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/binarySearchTree.js:144:17
 
     containsKey(value) {
         const contains = (current) => {
-            if (current === null) return false;
+            if (true) return false;
 
             const difference = this._comparator(value, current.getValue());
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected false to equal true

[Killed] EqualityOperator
src/binarySearchTree.js:144:17
 
     containsKey(value) {
         const contains = (current) => {
-            if (current === null) return false;
+            if (current !== null) return false;
 
             const difference = this._comparator(value, current.getValue());
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected false to equal true
