[Killed] EqualityOperator
src/binarySearchTree.js:147:17
             if (current === null) return false;
 
             const difference = this._comparator(value, current.getValue());
-            if (difference === 0) return true;
+            if (difference !== 0) return true;
             if (difference < 0) return contains(current.getLeft());
             return contains(current.getRight());
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:147:17
             if (current === null) return false;
 
             const difference = this._comparator(value, current.getValue());
-            if (difference === 0) return true;
+            if (true) return true;
             if (difference < 0) return contains(current.getLeft());
             return contains(current.getRight());
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:148:17
 
             const difference = this._comparator(value, current.getValue());
             if (difference === 0) return true;
-            if (difference < 0) return contains(current.getLeft());
+            if (true) return contains(current.getLeft());
             return contains(current.getRight());
         };
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected false to equal true

[Killed] EqualityOperator
src/binarySearchTree.js:148:17
 
             const difference = this._comparator(value, current.getValue());
             if (difference === 0) return true;
-            if (difference < 0) return contains(current.getLeft());
+            if (difference >= 0) return contains(current.getLeft());
             return contains(current.getRight());
         };
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected false to equal true

[Killed] BlockStatement
src/binarySearchTree.js:155:35
         return contains(this._root);
     }
 
-    treeHeight(node = this._root) {
-        if (node === null) return 0;
-        let lh = 0;
-        let rh = 0;
-
-        if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
-        if (node.hasRight()) rh = this.treeHeight(node.getRight());
-        return 1 + Math.max(lh, rh);
-    }
+    treeHeight(node = this._root) {}
 
     max(node = this._root) {
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected undefined to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:156:13
     }
 
     treeHeight(node = this._root) {
-        if (node === null) return 0;
+        if (true) return 0;
         let lh = 0;
         let rh = 0;
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected +0 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:156:13
     }
 
     treeHeight(node = this._root) {
-        if (node === null) return 0;
+        if (false) return 0;
         let lh = 0;
         let rh = 0;
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:160:13
         let lh = 0;
         let rh = 0;
 
-        if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
+        if (false) lh = this.treeHeight(node.getLeft());
         if (node.hasRight()) rh = this.treeHeight(node.getRight());
         return 1 + Math.max(lh, rh);
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:160:13
         let lh = 0;
         let rh = 0;
 
-        if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
+        if (true) lh = this.treeHeight(node.getLeft());
         if (node.hasRight()) rh = this.treeHeight(node.getRight());
         return 1 + Math.max(lh, rh);
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:161:13
         let rh = 0;
 
         if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
-        if (node.hasRight()) rh = this.treeHeight(node.getRight());
+        if (true) rh = this.treeHeight(node.getRight());
         return 1 + Math.max(lh, rh);
     }
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:161:13
         let rh = 0;
 
         if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
-        if (node.hasRight()) rh = this.treeHeight(node.getRight());
+        if (false) rh = this.treeHeight(node.getRight());
         return 1 + Math.max(lh, rh);
     }
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected 2 to equal 3

[Killed] ArithmeticOperator
src/binarySearchTree.js:162:16
 
         if (node.hasLeft()) lh = this.treeHeight(node.getLeft());
         if (node.hasRight()) rh = this.treeHeight(node.getRight());
-        return 1 + Math.max(lh, rh);
+        return 1 - Math.max(lh, rh);
     }
 
killedBy: BinarySearchTree tests .height(root) should get the height of tree
statusReason: expected +0 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:165:28
         return 1 + Math.max(lh, rh);
     }
 
-    max(node = this._root) {
-        if (node === null) return null;
-        if (node.hasRight()) return this.max(node.getRight());
-        return node;
-    }
+    max(node = this._root) {}
 
     findKey(value) {
killedBy: BinarySearchTree tests .max() get the node with max key
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:166:13
     }
 
     max(node = this._root) {
-        if (node === null) return null;
+        if (true) return null;
         if (node.hasRight()) return this.max(node.getRight());
         return node;
killedBy: BinarySearchTree tests .max() get the node with max key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:166:13
     }
 
     max(node = this._root) {
-        if (node === null) return null;
+        if (node !== null) return null;
         if (node.hasRight()) return this.max(node.getRight());
         return node;
killedBy: BinarySearchTree tests .max() get the node with max key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:167:13
 
     max(node = this._root) {
         if (node === null) return null;
-        if (node.hasRight()) return this.max(node.getRight());
+        if (true) return this.max(node.getRight());
         return node;
     }
killedBy: BinarySearchTree tests .max() get the node with max key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:167:13
 
     max(node = this._root) {
         if (node === null) return null;
-        if (node.hasRight()) return this.max(node.getRight());
+        if (false) return this.max(node.getRight());
         return node;
     }
killedBy: BinarySearchTree tests .max() get the node with max key
statusReason: expected 3 to equal 9

[Killed] BlockStatement
src/binarySearchTree.js:171:20
         return node;
     }
 
-    findKey(value) {
-        const get = (node) => {
-            if (node === null) return null;
-
-            const difference = this._comparator(value, node.getValue());
-            if (difference === 0) return node;
-            if (difference < 0) return get(node.getLeft());
-            return get(node.getRight());
-        };
-
-        return get(this._root);
-    }
+    findKey(value) {}
 
     min(node = this._root) {
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:172:31
     }
 
     findKey(value) {
-        const get = (node) => {
-            if (node === null) return null;
-
-            const difference = this._comparator(value, node.getValue());
-            if (difference === 0) return node;
-            if (difference < 0) return get(node.getLeft());
-            return get(node.getRight());
-        };
+        const get = (node) => {};
 
         return get(this._root);
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:173:17
 
     findKey(value) {
         const get = (node) => {
-            if (node === null) return null;
+            if (false) return null;
 
             const difference = this._comparator(value, node.getValue());
killedBy: BinarySearchTree tests .findKey(value) search node by its key in the tree
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:173:17
 
     findKey(value) {
         const get = (node) => {
-            if (node === null) return null;
+            if (node !== null) return null;
 
             const difference = this._comparator(value, node.getValue());
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:176:17
             if (node === null) return null;
 
             const difference = this._comparator(value, node.getValue());
-            if (difference === 0) return node;
+            if (difference !== 0) return node;
             if (difference < 0) return get(node.getLeft());
             return get(node.getRight());
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/binarySearchTree.js:176:17
             if (node === null) return null;
 
             const difference = this._comparator(value, node.getValue());
-            if (difference === 0) return node;
+            if (false) return node;
             if (difference < 0) return get(node.getLeft());
             return get(node.getRight());
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:177:17
 
             const difference = this._comparator(value, node.getValue());
             if (difference === 0) return node;
-            if (difference < 0) return get(node.getLeft());
+            if (false) return get(node.getLeft());
             return get(node.getRight());
         };
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:177:17
 
             const difference = this._comparator(value, node.getValue());
             if (difference === 0) return node;
-            if (difference < 0) return get(node.getLeft());
+            if (difference >= 0) return get(node.getLeft());
             return get(node.getRight());
         };
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:184:28
         return get(this._root);
     }
 
-    min(node = this._root) {
-        if (node === null) return null;
-        if (node.hasLeft()) return this.min(node.getLeft());
-        return node;
-    }
+    min(node = this._root) {}
 
     sum(node = this._root) {
killedBy: BinarySearchTree tests .min() get the node with min key
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:185:13
     }
 
     min(node = this._root) {
-        if (node === null) return null;
+        if (node !== null) return null;
         if (node.hasLeft()) return this.min(node.getLeft());
         return node;
killedBy: BinarySearchTree tests .min() get the node with min key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:185:13
     }
 
     min(node = this._root) {
-        if (node === null) return null;
+        if (true) return null;
         if (node.hasLeft()) return this.min(node.getLeft());
         return node;
killedBy: BinarySearchTree tests .min() get the node with min key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:186:13
 
     min(node = this._root) {
         if (node === null) return null;
-        if (node.hasLeft()) return this.min(node.getLeft());
+        if (false) return this.min(node.getLeft());
         return node;
     }
killedBy: BinarySearchTree tests .min() get the node with min key
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/binarySearchTree.js:186:13
 
     min(node = this._root) {
         if (node === null) return null;
-        if (node.hasLeft()) return this.min(node.getLeft());
+        if (true) return this.min(node.getLeft());
         return node;
     }
killedBy: BinarySearchTree tests .min() get the node with min key
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/binarySearchTree.js:190:28
         return node;
     }
 
-    sum(node = this._root) {
-        if (node === null) return 0;
-        return (
-            node.getValue() +
-            this.sum(node.getLeft()) +
-            this.sum(node.getRight())
-        );
-    }
+    sum(node = this._root) {}
 
     root() {
killedBy: BinarySearchTree tests .sum() should sum the nodes in BST correctly
statusReason: expected undefined to equal 37

[Killed] EqualityOperator
src/binarySearchTree.js:191:13
     }
 
     sum(node = this._root) {
-        if (node === null) return 0;
+        if (node !== null) return 0;
         return (
             node.getValue() +
killedBy: BinarySearchTree tests .sum() should sum the nodes in BST correctly
statusReason: expected +0 to equal 37

[Killed] ConditionalExpression
src/binarySearchTree.js:191:13
     }
 
     sum(node = this._root) {
-        if (node === null) return 0;
+        if (true) return 0;
         return (
             node.getValue() +
killedBy: BinarySearchTree tests .sum() should sum the nodes in BST correctly
statusReason: expected +0 to equal 37

[Killed] ArithmeticOperator
src/binarySearchTree.js:193:13
     sum(node = this._root) {
         if (node === null) return 0;
         return (
-            node.getValue() +
-            this.sum(node.getLeft()) +
+            node.getValue() - this.sum(node.getLeft()) +
             this.sum(node.getRight())
         );
killedBy: BinarySearchTree tests .sum() should sum the nodes in BST correctly
statusReason: expected 5 to equal 37

[Killed] ArithmeticOperator
src/binarySearchTree.js:193:13
     sum(node = this._root) {
         if (node === null) return 0;
         return (
-            node.getValue() +
-            this.sum(node.getLeft()) +
-            this.sum(node.getRight())
+            node.getValue() + this.sum(node.getLeft()) - this.sum(node.getRight())
         );
     }
killedBy: BinarySearchTree tests .sum() should sum the nodes in BST correctly
statusReason: expected 11 to equal 37

[Killed] BlockStatement
src/binarySearchTree.js:199:12
         );
     }
 
-    root() {
-        return this._root;
-    }
+    root() {}
 
     removeKey(value) {
killedBy: BinarySearchTree tests .constructPreOrder(pre, size) should construct a tree
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] EqualityOperator
src/binarySearchTree.js:205:17
 
     removeKey(value) {
         const removeNode = (val, temp) => {
-            if (temp === null) return false;
+            if (temp !== null) return false;
 
             const difference = this._comparator(val, temp.getValue());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:205:17
 
     removeKey(value) {
         const removeNode = (val, temp) => {
-            if (temp === null) return false;
+            if (true) return false;
 
             const difference = this._comparator(val, temp.getValue());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: expected true to equal false

[Killed] EqualityOperator
src/binarySearchTree.js:208:17
             if (temp === null) return false;
 
             const difference = this._comparator(val, temp.getValue());
-            if (difference < 0) return removeNode(val, temp.getLeft());
+            if (difference >= 0) return removeNode(val, temp.getLeft());
             if (difference > 0) return removeNode(val, temp.getRight());
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:208:17
             if (temp === null) return false;
 
             const difference = this._comparator(val, temp.getValue());
-            if (difference < 0) return removeNode(val, temp.getLeft());
+            if (false) return removeNode(val, temp.getLeft());
             if (difference > 0) return removeNode(val, temp.getRight());
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:209:17
 
             const difference = this._comparator(val, temp.getValue());
             if (difference < 0) return removeNode(val, temp.getLeft());
-            if (difference > 0) return removeNode(val, temp.getRight());
+            if (false) return removeNode(val, temp.getRight());
 
             if (temp.isLeaf()) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:209:17
 
             const difference = this._comparator(val, temp.getValue());
             if (difference < 0) return removeNode(val, temp.getLeft());
-            if (difference > 0) return removeNode(val, temp.getRight());
+            if (true) return removeNode(val, temp.getRight());
 
             if (temp.isLeaf()) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/binarySearchTree.js:211:17
             if (difference < 0) return removeNode(val, temp.getLeft());
             if (difference > 0) return removeNode(val, temp.getRight());
 
-            if (temp.isLeaf()) {
+            if (false) {
                 if (temp.isRoot()) {
                     this._root = null;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:211:32
             if (difference < 0) return removeNode(val, temp.getLeft());
             if (difference > 0) return removeNode(val, temp.getRight());
 
-            if (temp.isLeaf()) {
-                if (temp.isRoot()) {
-                    this._root = null;
-                } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
-                ) {
-                    temp.getParent().setLeft(null);
-                } else {
-                    temp.getParent().setRight(null);
-                }
-                this._count -= 1;
-                return true;
-            }
+            if (temp.isLeaf()) {}
 
             if (!temp.hasRight()) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:212:21
             if (difference > 0) return removeNode(val, temp.getRight());
 
             if (temp.isLeaf()) {
-                if (temp.isRoot()) {
+                if (true) {
                     this._root = null;
                 } else if (
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:212:21
             if (difference > 0) return removeNode(val, temp.getRight());
 
             if (temp.isLeaf()) {
-                if (temp.isRoot()) {
+                if (false) {
                     this._root = null;
                 } else if (
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] EqualityOperator
src/binarySearchTree.js:215:21
                 if (temp.isRoot()) {
                     this._root = null;
                 } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
+                    this._comparator(val, temp.getParent().getValue()) <= 0
                 ) {
                     temp.getParent().setLeft(null);
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:215:21
                 if (temp.isRoot()) {
                     this._root = null;
                 } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
+                    false
                 ) {
                     temp.getParent().setLeft(null);
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:216:19
                     this._root = null;
                 } else if (
                     this._comparator(val, temp.getParent().getValue()) < 0
-                ) {
-                    temp.getParent().setLeft(null);
-                } else {
+                ) {} else {
                     temp.getParent().setRight(null);
                 }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:218:24
                     this._comparator(val, temp.getParent().getValue()) < 0
                 ) {
                     temp.getParent().setLeft(null);
-                } else {
-                    temp.getParent().setRight(null);
-                }
+                } else {}
                 this._count -= 1;
                 return true;
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with two children
statusReason: Cannot read properties of null (reading 'getRight')

[Killed] AssignmentOperator
src/binarySearchTree.js:221:17
                 } else {
                     temp.getParent().setRight(null);
                 }
-                this._count -= 1;
+                this._count += 1;
                 return true;
             }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BooleanLiteral
src/binarySearchTree.js:222:24
                     temp.getParent().setRight(null);
                 }
                 this._count -= 1;
-                return true;
+                return false;
             }
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:225:35
                 return true;
             }
 
-            if (!temp.hasRight()) {
-                if (temp.isRoot()) {
-                    this._root = temp.getLeft();
-                } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
-                ) {
-                    temp.getParent().setLeft(temp.getLeft());
-                } else {
-                    temp.getParent().setRight(temp.getLeft());
-                }
-                temp.getLeft().setParent(temp.getParent());
-                this._count -= 1;
-                return true;
-            }
+            if (!temp.hasRight()) {}
 
             if (!temp.hasLeft()) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:225:17
                 return true;
             }
 
-            if (!temp.hasRight()) {
+            if (false) {
                 if (temp.isRoot()) {
                     this._root = temp.getLeft();
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] ConditionalExpression
src/binarySearchTree.js:226:21
             }
 
             if (!temp.hasRight()) {
-                if (temp.isRoot()) {
+                if (false) {
                     this._root = temp.getLeft();
                 } else if (
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:226:21
             }
 
             if (!temp.hasRight()) {
-                if (temp.isRoot()) {
+                if (true) {
                     this._root = temp.getLeft();
                 } else if (
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:229:21
                 if (temp.isRoot()) {
                     this._root = temp.getLeft();
                 } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
+                    true
                 ) {
                     temp.getParent().setLeft(temp.getLeft());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/binarySearchTree.js:230:19
                     this._root = temp.getLeft();
                 } else if (
                     this._comparator(val, temp.getParent().getValue()) < 0
-                ) {
-                    temp.getParent().setLeft(temp.getLeft());
-                } else {
+                ) {} else {
                     temp.getParent().setRight(temp.getLeft());
                 }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[NoCoverage] BlockStatement
src/binarySearchTree.js:232:24
                     this._comparator(val, temp.getParent().getValue()) < 0
                 ) {
                     temp.getParent().setLeft(temp.getLeft());
-                } else {
-                    temp.getParent().setRight(temp.getLeft());
-                }
+                } else {}
                 temp.getLeft().setParent(temp.getParent());
                 this._count -= 1;

[Killed] AssignmentOperator
src/binarySearchTree.js:236:17
                     temp.getParent().setRight(temp.getLeft());
                 }
                 temp.getLeft().setParent(temp.getParent());
-                this._count -= 1;
+                this._count += 1;
                 return true;
             }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a left child only
statusReason: expected 2 to equal 3

[Killed] ConditionalExpression
src/binarySearchTree.js:240:17
                 return true;
             }
 
-            if (!temp.hasLeft()) {
+            if (true) {
                 if (temp.isRoot()) {
                     this._root = temp.getRight();
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] ConditionalExpression
src/binarySearchTree.js:240:17
                 return true;
             }
 
-            if (!temp.hasLeft()) {
+            if (false) {
                 if (temp.isRoot()) {
                     this._root = temp.getRight();
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] ConditionalExpression
src/binarySearchTree.js:241:21
             }
 
             if (!temp.hasLeft()) {
-                if (temp.isRoot()) {
+                if (false) {
                     this._root = temp.getRight();
                 } else if (
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4
