[Killed] BlockStatement
src/binarySearchTree.js:241:36
             }
 
             if (!temp.hasLeft()) {
-                if (temp.isRoot()) {
-                    this._root = temp.getRight();
-                } else if (
+                if (temp.isRoot()) {} else if (
                     this._comparator(val, temp.getParent().getValue()) < 0
                 ) {
killedBy: BinarySearchTree tests .removeKey(value) should removeKey root node with right child
statusReason: expected 25 to equal 10

[Killed] EqualityOperator
src/binarySearchTree.js:244:21
                 if (temp.isRoot()) {
                     this._root = temp.getRight();
                 } else if (
-                    this._comparator(val, temp.getParent().getValue()) < 0
+                    this._comparator(val, temp.getParent().getValue()) >= 0
                 ) {
                     temp.getParent().setLeft(temp.getRight());
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] BlockStatement
src/binarySearchTree.js:245:19
                     this._root = temp.getRight();
                 } else if (
                     this._comparator(val, temp.getParent().getValue()) < 0
-                ) {
-                    temp.getParent().setLeft(temp.getRight());
-                } else {
+                ) {} else {
                     temp.getParent().setRight(temp.getRight());
                 }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Survived] BlockStatement
src/binarySearchTree.js:247:24
                     this._comparator(val, temp.getParent().getValue()) < 0
                 ) {
                     temp.getParent().setLeft(temp.getRight());
-                } else {
-                    temp.getParent().setRight(temp.getRight());
-                }
+                } else {}
                 temp.getRight().setParent(temp.getParent());
                 this._count -= 1;

[Killed] AssignmentOperator
src/binarySearchTree.js:251:17
                     temp.getParent().setRight(temp.getRight());
                 }
                 temp.getRight().setParent(temp.getParent());
-                this._count -= 1;
+                this._count += 1;
                 return true;
             }
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a node with a right child only
statusReason: expected 2 to equal 4

[Killed] BlockStatement
src/binarySearchTree.js:263:17
         return removeNode(value, this._root);
     }
 
-    inOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            recurse(temp.getLeft());
-            cb(temp);
-            recurse(temp.getRight());
-        };
-        recurse(this._root);
-    }
+    inOrder(cb) {}
 
     preOrder(cb) {
killedBy: BinarySearchTree tests .inOrder(cb) traverse the tree in-order
statusReason: expected [] to deeply equal [ 2, 3, 4, 5, 6, 8, 9 ]

[Killed] BlockStatement
src/binarySearchTree.js:264:35
     }
 
     inOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            recurse(temp.getLeft());
-            cb(temp);
-            recurse(temp.getRight());
-        };
+        const recurse = (temp) => {};
         recurse(this._root);
     }
killedBy: BinarySearchTree tests .inOrder(cb) traverse the tree in-order
statusReason: expected [] to deeply equal [ 2, 3, 4, 5, 6, 8, 9 ]

[Killed] EqualityOperator
src/binarySearchTree.js:265:17
 
     inOrder(cb) {
         const recurse = (temp) => {
-            if (temp === null) return;
+            if (temp !== null) return;
             recurse(temp.getLeft());
             cb(temp);
killedBy: BinarySearchTree tests .inOrder(cb) traverse the tree in-order
statusReason: expected [] to deeply equal [ 2, 3, 4, 5, 6, 8, 9 ]

[Killed] ConditionalExpression
src/binarySearchTree.js:265:17
 
     inOrder(cb) {
         const recurse = (temp) => {
-            if (temp === null) return;
+            if (false) return;
             recurse(temp.getLeft());
             cb(temp);
killedBy: BinarySearchTree tests .inOrder(cb) traverse the tree in-order
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/binarySearchTree.js:273:18
         recurse(this._root);
     }
 
-    preOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            cb(temp);
-            recurse(temp.getLeft());
-            recurse(temp.getRight());
-        };
-        recurse(this._root);
-    }
+    preOrder(cb) {}
 
     postOrder(cb) {
killedBy: BinarySearchTree tests .preOrder(cb) traverse the tree pre-order
statusReason: expected [] to deeply equal [ 5, 3, 2, 4, 8, 6, 9 ]

[Killed] BlockStatement
src/binarySearchTree.js:274:35
     }
 
     preOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            cb(temp);
-            recurse(temp.getLeft());
-            recurse(temp.getRight());
-        };
+        const recurse = (temp) => {};
         recurse(this._root);
     }
killedBy: BinarySearchTree tests .preOrder(cb) traverse the tree pre-order
statusReason: expected [] to deeply equal [ 5, 3, 2, 4, 8, 6, 9 ]

[Killed] ConditionalExpression
src/binarySearchTree.js:275:17
 
     preOrder(cb) {
         const recurse = (temp) => {
-            if (temp === null) return;
+            if (true) return;
             cb(temp);
             recurse(temp.getLeft());
killedBy: BinarySearchTree tests .preOrder(cb) traverse the tree pre-order
statusReason: expected [] to deeply equal [ 5, 3, 2, 4, 8, 6, 9 ]

[Killed] BlockStatement
src/binarySearchTree.js:283:19
         recurse(this._root);
     }
 
-    postOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            recurse(temp.getLeft());
-            recurse(temp.getRight());
-            cb(temp);
-        };
-        recurse(this._root);
-    }
+    postOrder(cb) {}
 }
 
killedBy: BinarySearchTree tests .postOrder(cb) traverse the tree post-order
statusReason: expected [] to deeply equal [ 2, 4, 3, 6, 9, 8, 5 ]

[Killed] BlockStatement
src/binarySearchTree.js:284:35
     }
 
     postOrder(cb) {
-        const recurse = (temp) => {
-            if (temp === null) return;
-            recurse(temp.getLeft());
-            recurse(temp.getRight());
-            cb(temp);
-        };
+        const recurse = (temp) => {};
         recurse(this._root);
     }
killedBy: BinarySearchTree tests .postOrder(cb) traverse the tree post-order
statusReason: expected [] to deeply equal [ 2, 4, 3, 6, 9, 8, 5 ]

[Killed] BlockStatement
src/binarySearchTree.js:294:30
     }
 }
 
-const comparator = (a, b) => {
-    if (a === b) return 0;
-    return a > b ? 1 : -1;
-};
+const comparator = (a, b) => {};
 
 module.exports = { BinarySearchTree, BinarySearchTreeNode };
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:295:9
 }
 
 const comparator = (a, b) => {
-    if (a === b) return 0;
+    if (false) return 0;
     return a > b ? 1 : -1;
 };
killedBy: BinarySearchTree tests .insertKey(value) insert nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/binarySearchTree.js:295:9
 }
 
 const comparator = (a, b) => {
-    if (a === b) return 0;
+    if (true) return 0;
     return a > b ? 1 : -1;
 };
killedBy: BinarySearchTree tests .containsKey(value) whether node exists by key
statusReason: expected true to equal false

[Killed] UnaryOperator
src/binarySearchTree.js:296:24
 
 const comparator = (a, b) => {
     if (a === b) return 0;
-    return a > b ? 1 : -1;
+    return a > b ? 1 : +1;
 };
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: expected BinarySearchTreeNode{ _value: 2, …(3) } to equal null

[Killed] EqualityOperator
src/binarySearchTree.js:296:12
 
 const comparator = (a, b) => {
     if (a === b) return 0;
-    return a > b ? 1 : -1;
+    return a >= b ? 1 : -1;
 };
 
killedBy: BinarySearchTree tests .removeKey(value) should removeKey a leaf node
statusReason: expected true to equal false
