[Killed] BlockStatement
src/linkedList.js:2:30
 class LinkedListNode {
-    constructor(value, next) {
-        this._value = value;
-        this.setNext(next);
-    }
+    constructor(value, next) {}
 
     setValue(value) {
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected undefined to equal 20

[Killed] BlockStatement
src/linkedList.js:16:19
         return this._value;
     }
 
-    setNext(next) {
-        if (next && !(next instanceof LinkedListNode)) {
-            throw new Error('setNext expects a LinkedListNode or null');
-        }
-        this._next = next || null;
-        return this;
-    }
+    setNext(next) {}
 
     getNext() {
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected undefined to equal LinkedListNode{ _value: 10 }

[Killed] LogicalOperator
src/linkedList.js:17:13
     }
 
     setNext(next) {
-        if (next && !(next instanceof LinkedListNode)) {
+        if (next || !(next instanceof LinkedListNode)) {
             throw new Error('setNext expects a LinkedListNode or null');
         }
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: setNext expects a LinkedListNode or null

[Killed] BooleanLiteral
src/linkedList.js:17:21
     }
 
     setNext(next) {
-        if (next && !(next instanceof LinkedListNode)) {
+        if (next && next instanceof LinkedListNode) {
             throw new Error('setNext expects a LinkedListNode or null');
         }
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: setNext expects a LinkedListNode or null

[Killed] ConditionalExpression
src/linkedList.js:20:22
         if (next && !(next instanceof LinkedListNode)) {
             throw new Error('setNext expects a LinkedListNode or null');
         }
-        this._next = next || null;
+        this._next = false;
         return this;
     }
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected false to equal LinkedListNode{ _value: 10, …(1) }

[Killed] ConditionalExpression
src/linkedList.js:20:22
         if (next && !(next instanceof LinkedListNode)) {
             throw new Error('setNext expects a LinkedListNode or null');
         }
-        this._next = next || null;
+        this._next = true;
         return this;
     }
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected true to equal LinkedListNode{ _value: 10, …(1) }

[Killed] BlockStatement
src/linkedList.js:24:15
         return this;
     }
 
-    getNext() {
-        return this._next;
-    }
+    getNext() {}
 
     hasNext() {
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected undefined to equal LinkedListNode{ _value: 10, …(1) }

[Killed] BlockStatement
src/linkedList.js:28:15
         return this._next;
     }
 
-    hasNext() {
-        return this._next instanceof LinkedListNode;
-    }
+    hasNext() {}
 }
 
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/linkedList.js:34:19
 }
 
 class LinkedList {
-    constructor() {
-        this._head = null;
-        this._count = 0;
-    }
+    constructor() {}
 
     head() {
killedBy: linkedList tests .head() get the head node
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/linkedList.js:39:12
         this._count = 0;
     }
 
-    head() {
-        return this._head;
-    }
+    head() {}
 
     count() {
killedBy: linkedList tests .head() get the head node
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/linkedList.js:43:13
         return this._head;
     }
 
-    count() {
-        return this._count;
-    }
+    count() {}
 
     insertFirst(value) {
killedBy: linkedList tests .count() get the count of nodes in the list
statusReason: expected undefined to equal 5

[Killed] BlockStatement
src/linkedList.js:47:24
         return this._count;
     }
 
-    insertFirst(value) {
-        this._head = new LinkedListNode(value, this._head);
-        this._count += 1;
-        return this._head;
-    }
+    insertFirst(value) {}
 
     insertLast(value) {
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] AssignmentOperator
src/linkedList.js:49:9
 
     insertFirst(value) {
         this._head = new LinkedListNode(value, this._head);
-        this._count += 1;
+        this._count -= 1;
         return this._head;
     }
killedBy: linkedList tests .count() get the count of nodes in the list
statusReason: expected -5 to equal 5

[Killed] BlockStatement
src/linkedList.js:53:23
         return this._head;
     }
 
-    insertLast(value) {
-        if (this.isEmpty()) {
-            return this.insertFirst(value);
-        }
-
-        let current = this._head;
-        while (current.hasNext()) {
-            current = current.getNext();
-        }
-
-        current.setNext(new LinkedListNode(value, null));
-        this._count += 1;
-        return current.getNext();
-    }
+    insertLast(value) {}
 
     insertAt(position, value) {
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected +0 to equal 4

[Killed] ConditionalExpression
src/linkedList.js:54:13
     }
 
     insertLast(value) {
-        if (this.isEmpty()) {
+        if (true) {
             return this.insertFirst(value);
         }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected 4 to equal 1

[Killed] ConditionalExpression
src/linkedList.js:54:13
     }
 
     insertLast(value) {
-        if (this.isEmpty()) {
+        if (false) {
             return this.insertFirst(value);
         }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: Cannot read properties of null (reading 'hasNext')

[Killed] ConditionalExpression
src/linkedList.js:59:16
         }
 
         let current = this._head;
-        while (current.hasNext()) {
+        while (false) {
             current = current.getNext();
         }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected 4 to equal 2

[Timeout] BlockStatement
src/linkedList.js:59:35
         }
 
         let current = this._head;
-        while (current.hasNext()) {
-            current = current.getNext();
-        }
+        while (current.hasNext()) {}
 
         current.setNext(new LinkedListNode(value, null));

[Killed] AssignmentOperator
src/linkedList.js:64:9
         }
 
         current.setNext(new LinkedListNode(value, null));
-        this._count += 1;
+        this._count -= 1;
         return current.getNext();
     }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected -2 to equal 4

[Killed] BlockStatement
src/linkedList.js:68:31
         return current.getNext();
     }
 
-    insertAt(position, value) {
-        if (Number.isNaN(+position) || position < 0 || position > this._count) {
-            throw new Error(
-                '.insertAt expects a position num <= linked list size'
-            );
-        }
-
-        // head node is at position 0
-        if (position === 0) {
-            return this.insertFirst(value);
-        }
-
-        let currentPosition = 1;
-        let prev = this._head;
-        while (currentPosition < position) {
-            currentPosition += 1;
-            prev = prev.getNext();
-        }
-
-        // add it at a position after the head, between prev & prev.getNext()
-        prev.setNext(new LinkedListNode(value, prev.getNext()));
-        this._count += 1;
-        return prev.getNext();
-    }
+    insertAt(position, value) {}
 
     removeFirst() {
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: expected 5 to equal 6

[Killed] EqualityOperator
src/linkedList.js:69:40
     }
 
     insertAt(position, value) {
-        if (Number.isNaN(+position) || position < 0 || position > this._count) {
+        if (Number.isNaN(+position) || position <= 0 || position > this._count) {
             throw new Error(
                 '.insertAt expects a position num <= linked list size'
killedBy: linkedList tests .insertAt(position, value) index = 0
statusReason: .insertAt expects a position num <= linked list size

[Killed] ConditionalExpression
src/linkedList.js:69:56
     }
 
     insertAt(position, value) {
-        if (Number.isNaN(+position) || position < 0 || position > this._count) {
+        if (Number.isNaN(+position) || position < 0 || false) {
             throw new Error(
                 '.insertAt expects a position num <= linked list size'
killedBy: linkedList tests .insertAt(position, value) throws an error position is not a valid number (exceed)
statusReason: expected TypeError: Cannot read properties of null… to have property 'message' of '.insertAt expects a position num <= l…', but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/linkedList.js:76:29
         }
 
         // head node is at position 0
-        if (position === 0) {
-            return this.insertFirst(value);
-        }
+        if (position === 0) {}
 
         let currentPosition = 1;
killedBy: linkedList tests .insertAt(position, value) index = 0
statusReason: expected 1 to equal 8

[Killed] ConditionalExpression
src/linkedList.js:76:13
         }
 
         // head node is at position 0
-        if (position === 0) {
+        if (true) {
             return this.insertFirst(value);
         }
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: expected 8 to equal 1

[Killed] EqualityOperator
src/linkedList.js:82:16
 
         let currentPosition = 1;
         let prev = this._head;
-        while (currentPosition < position) {
+        while (currentPosition <= position) {
             currentPosition += 1;
             prev = prev.getNext();
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: expected 4 to equal 8

[Killed] EqualityOperator
src/linkedList.js:82:16
 
         let currentPosition = 1;
         let prev = this._head;
-        while (currentPosition < position) {
+        while (currentPosition >= position) {
             currentPosition += 1;
             prev = prev.getNext();
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: expected 8 to equal 2

[Killed] AssignmentOperator
src/linkedList.js:83:13
         let currentPosition = 1;
         let prev = this._head;
         while (currentPosition < position) {
-            currentPosition += 1;
+            currentPosition -= 1;
             prev = prev.getNext();
         }
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] AssignmentOperator
src/linkedList.js:89:9
 
         // add it at a position after the head, between prev & prev.getNext()
         prev.setNext(new LinkedListNode(value, prev.getNext()));
-        this._count += 1;
+        this._count -= 1;
         return prev.getNext();
     }
killedBy: linkedList tests .insertAt(position, value) Valid positive index in between
statusReason: expected 4 to equal 6

[Killed] BlockStatement
src/linkedList.js:93:19
         return prev.getNext();
     }
 
-    removeFirst() {
-        if (this.isEmpty()) return null;
-
-        const removed = this._head;
-        this._head = this._head.getNext();
-        this._count -= 1;
-        return removed.setNext(null);
-    }
+    removeFirst() {}
 
     removeLast() {
killedBy: linkedList tests .removeFirst() remove the first node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:94:13
     }
 
     removeFirst() {
-        if (this.isEmpty()) return null;
+        if (true) return null;
 
         const removed = this._head;
killedBy: linkedList tests .removeFirst() remove the first node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:94:13
     }
 
     removeFirst() {
-        if (this.isEmpty()) return null;
+        if (false) return null;
 
         const removed = this._head;
killedBy: linkedList tests .removeFirst() remove the first node in empty list
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] AssignmentOperator
src/linkedList.js:98:9
 
         const removed = this._head;
         this._head = this._head.getNext();
-        this._count -= 1;
+        this._count += 1;
         return removed.setNext(null);
     }
killedBy: linkedList tests .removeFirst() remove the first node
statusReason: expected 6 to equal 4

[Killed] BlockStatement
src/linkedList.js:102:18
         return removed.setNext(null);
     }
 
-    removeLast() {
-        if (this.isEmpty()) return null;
-
-        let prev = null;
-        let current = this._head;
-        while (current.hasNext()) {
-            prev = current;
-            current = current.getNext();
-        }
-
-        // linked list has 1 node
-        if (prev === null) {
-            return this.removeFirst();
-        }
-
-        prev.setNext(null);
-        this._count -= 1;
-        return current;
-    }
+    removeLast() {}
 
     removeAt(position) {
killedBy: linkedList tests .removeLast() in empty list
statusReason: expected undefined to equal null

[Killed] ConditionalExpression
src/linkedList.js:103:13
     }
 
     removeLast() {
-        if (this.isEmpty()) return null;
+        if (false) return null;
 
         let prev = null;
killedBy: linkedList tests .removeLast() in empty list
statusReason: Cannot read properties of null (reading 'hasNext')

[Killed] ConditionalExpression
src/linkedList.js:103:13
     }
 
     removeLast() {
-        if (this.isEmpty()) return null;
+        if (true) return null;
 
         let prev = null;
killedBy: linkedList tests .removeLast() remove the last node in list with more than 1 nodes
statusReason: Cannot read properties of null (reading 'getValue')

[Timeout] BlockStatement
src/linkedList.js:107:35
 
         let prev = null;
         let current = this._head;
-        while (current.hasNext()) {
-            prev = current;
-            current = current.getNext();
-        }
+        while (current.hasNext()) {}
 
         // linked list has 1 node

[Killed] BlockStatement
src/linkedList.js:113:28
         }
 
         // linked list has 1 node
-        if (prev === null) {
-            return this.removeFirst();
-        }
+        if (prev === null) {}
 
         prev.setNext(null);
killedBy: linkedList tests .removeLast() remove the last node in list with 1 node
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] EqualityOperator
src/linkedList.js:113:13
         }
 
         // linked list has 1 node
-        if (prev === null) {
+        if (prev !== null) {
             return this.removeFirst();
         }
killedBy: linkedList tests .removeLast() remove the last node in list with more than 1 nodes
statusReason: expected 1 to equal 5

[Killed] AssignmentOperator
src/linkedList.js:118:9
         }
 
         prev.setNext(null);
-        this._count -= 1;
+        this._count += 1;
         return current;
     }
killedBy: linkedList tests .removeLast() remove the last node in list with more than 1 nodes
statusReason: expected 6 to equal 4

[Killed] BlockStatement
src/linkedList.js:122:24
         return current;
     }
 
-    removeAt(position) {
-        if (
-            Number.isNaN(+position) ||
-            position < 0 ||
-            position >= this._count
-        ) {
-            return null;
-        }
-
-        if (position === 0) {
-            return this.removeFirst();
-        }
-
-        let counter = 1;
-        let prev = this._head;
-        while (counter < position) {
-            counter += 1;
-            prev = prev.getNext();
-        }
-        const removed = prev.getNext();
-        prev.setNext(prev.getNext().getNext());
-        this._count -= 1;
-        return removed.setNext(null);
-    }
+    removeAt(position) {}
 
     getByIndex(index) {
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:124:13
 
     removeAt(position) {
         if (
-            Number.isNaN(+position) ||
-            position < 0 ||
-            position >= this._count
+            true
         ) {
             return null;
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] LogicalOperator
src/linkedList.js:124:13
 
     removeAt(position) {
         if (
-            Number.isNaN(+position) ||
-            position < 0 ||
-            position >= this._count
+            (Number.isNaN(+position) || position < 0) && position >= this._count
         ) {
             return null;
killedBy: linkedList tests .removeAt(position) does nothing if position is not valid (not number)
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] EqualityOperator
src/linkedList.js:125:13
     removeAt(position) {
         if (
             Number.isNaN(+position) ||
-            position < 0 ||
+            position >= 0 ||
             position >= this._count
         ) {
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:125:13
     removeAt(position) {
         if (
             Number.isNaN(+position) ||
-            position < 0 ||
+            position <= 0 ||
             position >= this._count
         ) {
killedBy: linkedList tests .removeAt(position) remove a node from first
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:126:13
         if (
             Number.isNaN(+position) ||
             position < 0 ||
-            position >= this._count
+            position < this._count
         ) {
             return null;
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:126:13
         if (
             Number.isNaN(+position) ||
             position < 0 ||
-            position >= this._count
+            false
         ) {
             return null;
killedBy: linkedList tests .removeAt(position) does nothing if position is not valid (exceed limit)
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] BlockStatement
src/linkedList.js:127:11
             Number.isNaN(+position) ||
             position < 0 ||
             position >= this._count
-        ) {
-            return null;
-        }
+        ) {}
 
         if (position === 0) {
killedBy: linkedList tests .removeAt(position) does nothing if position is not valid (not number)
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] ConditionalExpression
src/linkedList.js:131:13
             return null;
         }
 
-        if (position === 0) {
+        if (false) {
             return this.removeFirst();
         }
killedBy: linkedList tests .removeAt(position) remove a node from first
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/linkedList.js:131:13
             return null;
         }
 
-        if (position === 0) {
+        if (true) {
             return this.removeFirst();
         }
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: expected 1 to equal 4

[Killed] EqualityOperator
src/linkedList.js:137:16
 
         let counter = 1;
         let prev = this._head;
-        while (counter < position) {
+        while (counter <= position) {
             counter += 1;
             prev = prev.getNext();
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: expected 5 to equal 4

[Killed] EqualityOperator
src/linkedList.js:137:16
 
         let counter = 1;
         let prev = this._head;
-        while (counter < position) {
+        while (counter >= position) {
             counter += 1;
             prev = prev.getNext();
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: expected 2 to equal 4

[Killed] AssignmentOperator
src/linkedList.js:138:13
         let counter = 1;
         let prev = this._head;
         while (counter < position) {
-            counter += 1;
+            counter -= 1;
             prev = prev.getNext();
         }
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] AssignmentOperator
src/linkedList.js:143:9
         }
         const removed = prev.getNext();
         prev.setNext(prev.getNext().getNext());
-        this._count -= 1;
+        this._count += 1;
         return removed.setNext(null);
     }
killedBy: linkedList tests .removeAt(position) remove a node from between
statusReason: expected 6 to equal 4

[Killed] BlockStatement
src/linkedList.js:147:23
         return removed.setNext(null);
     }
 
-    getByIndex(index) {
-        if (index < 0 || index >= this._count) {
-            throw new Error('.getByIndex: Index out of bounds error');
-        }
-
-        let current = this._head;
-        for (let i = 0; i < index; i++) {
-            current = current.getNext();
-        }
-        return current;
-    }
+    getByIndex(index) {}
 
     search(value) {
killedBy: linkedList tests .getByIndex(index) valid Index
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:148:26
     }
 
     getByIndex(index) {
-        if (index < 0 || index >= this._count) {
+        if (index < 0 || index > this._count) {
             throw new Error('.getByIndex: Index out of bounds error');
         }
killedBy: linkedList tests .getByIndex(index) Throws error when invalid index at boundary
statusReason: expected [Function] to throw Error

[Killed] LogicalOperator
src/linkedList.js:148:13
     }
 
     getByIndex(index) {
-        if (index < 0 || index >= this._count) {
+        if (index < 0 && index >= this._count) {
             throw new Error('.getByIndex: Index out of bounds error');
         }
killedBy: linkedList tests .getByIndex(index) Throws error when invalid index
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/linkedList.js:153:25
         }
 
         let current = this._head;
-        for (let i = 0; i < index; i++) {
+        for (let i = 0; false; i++) {
             current = current.getNext();
         }
killedBy: linkedList tests .getByIndex(index) valid Index
statusReason: expected 1 to equal 4

[Killed] BlockStatement
src/linkedList.js:153:41
         }
 
         let current = this._head;
-        for (let i = 0; i < index; i++) {
-            current = current.getNext();
-        }
+        for (let i = 0; i < index; i++) {}
         return current;
     }
killedBy: linkedList tests .getByIndex(index) valid Index
statusReason: expected 1 to equal 4

[Killed] BlockStatement
src/linkedList.js:159:19
         return current;
     }
 
-    search(value) {
-        let current = this._head;
-
-        while (current) {
-            if (current.getValue() === value) {
-                return true;
-            }
-            current = current.getNext();
-        }
-
-        return false;
-    }
+    search(value) {}
 
     reverse() {
killedBy: linkedList tests .search() Searching the list with element present
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/linkedList.js:162:16
     search(value) {
         let current = this._head;
 
-        while (current) {
+        while (false) {
             if (current.getValue() === value) {
                 return true;
killedBy: linkedList tests .search() Searching the list with element present
statusReason: expected false to equal true

[Timeout] BlockStatement
src/linkedList.js:162:25
     search(value) {
         let current = this._head;
 
-        while (current) {
-            if (current.getValue() === value) {
-                return true;
-            }
-            current = current.getNext();
-        }
+        while (current) {}
 
         return false;

[Killed] ConditionalExpression
src/linkedList.js:163:17
         let current = this._head;
 
         while (current) {
-            if (current.getValue() === value) {
+            if (false) {
                 return true;
             }
killedBy: linkedList tests .search() Searching the list with element present
statusReason: expected false to equal true

[Killed] BlockStatement
src/linkedList.js:163:47
         let current = this._head;
 
         while (current) {
-            if (current.getValue() === value) {
-                return true;
-            }
+            if (current.getValue() === value) {}
             current = current.getNext();
         }
killedBy: linkedList tests .search() Searching the list with element present
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/linkedList.js:164:24
 
         while (current) {
             if (current.getValue() === value) {
-                return true;
+                return false;
             }
             current = current.getNext();
killedBy: linkedList tests .search() Searching the list with element present
statusReason: expected false to equal true

[Killed] BlockStatement
src/linkedList.js:172:15
         return false;
     }
 
-    reverse() {
-        let prev = null;
-        let cur = this._head;
-        let cur_next;
-
-        while (cur != null) {
-            cur_next = cur.getNext();
-            cur.setNext(prev);
-            prev = cur;
-            cur = cur_next;
-        }
-
-        let newHead = prev;
-        this._head = newHead;
-        return newHead;
-    }
+    reverse() {}
 
     findMid(head = this._head) {
killedBy: linkedList tests .reverse() Reversing a list
statusReason: expected 1 to equal 5

[Killed] ConditionalExpression
src/linkedList.js:177:16
         let cur = this._head;
         let cur_next;
 
-        while (cur != null) {
+        while (false) {
             cur_next = cur.getNext();
             cur.setNext(prev);
killedBy: linkedList tests .reverse() Reversing a list
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:177:16
         let cur = this._head;
         let cur_next;
 
-        while (cur != null) {
+        while (cur == null) {
             cur_next = cur.getNext();
             cur.setNext(prev);
killedBy: linkedList tests .reverse() Reversing a list
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:189:32
         return newHead;
     }
 
-    findMid(head = this._head) {
-        if (head === null) {
-            return head;
-        }
-
-        let slow = head;
-        let fast = head;
-
-        while (fast.getNext() != null && fast.getNext().getNext() != null) {
-            slow = slow.getNext();
-            fast = fast.getNext().getNext();
-        }
-
-        return slow;
-    }
+    findMid(head = this._head) {}
 
     static sortedMerge(a, b) {
killedBy: linkedList tests .findMid() Finding middle element in the list
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:190:13
     }
 
     findMid(head = this._head) {
-        if (head === null) {
+        if (true) {
             return head;
         }
killedBy: linkedList tests .findMid() Finding middle element in the list
statusReason: expected 1 to equal 3

[Killed] BlockStatement
src/linkedList.js:190:28
     }
 
     findMid(head = this._head) {
-        if (head === null) {
-            return head;
-        }
+        if (head === null) {}
 
         let slow = head;
killedBy: linkedList tests .findMid() Finding middle element in the empty list
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] EqualityOperator
src/linkedList.js:197:42
         let slow = head;
         let fast = head;
 
-        while (fast.getNext() != null && fast.getNext().getNext() != null) {
+        while (fast.getNext() != null && fast.getNext().getNext() == null) {
             slow = slow.getNext();
             fast = fast.getNext().getNext();
killedBy: linkedList tests .findMid() Finding middle element in the list
statusReason: expected 1 to equal 3

[Killed] LogicalOperator
src/linkedList.js:197:16
         let slow = head;
         let fast = head;
 
-        while (fast.getNext() != null && fast.getNext().getNext() != null) {
+        while (fast.getNext() != null || fast.getNext().getNext() != null) {
             slow = slow.getNext();
             fast = fast.getNext().getNext();
killedBy: linkedList tests .findMid() Finding middle element in the list
statusReason: Cannot read properties of null (reading 'getNext')
