[Killed] BlockStatement
src/linkedList.js:205:30
         return slow;
     }
 
-    static sortedMerge(a, b) {
-        let result = null;
-
-        if (a === null) {
-            return b;
-        }
-
-        if (b === null) {
-            return a;
-        }
-
-        if (a.getValue() <= b.getValue()) {
-            result = a;
-            result.setNext(LinkedList.sortedMerge(a.getNext(), b));
-        } else {
-            result = b;
-            result.setNext(LinkedList.sortedMerge(a, b.getNext()));
-        }
-
-        this._head = result;
-        return result;
-    }
+    static sortedMerge(a, b) {}
 
     mergeSort(head = this._head) {
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:208:13
     static sortedMerge(a, b) {
         let result = null;
 
-        if (a === null) {
+        if (true) {
             return b;
         }
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 4 to equal 1

[Killed] EqualityOperator
src/linkedList.js:208:13
     static sortedMerge(a, b) {
         let result = null;
 
-        if (a === null) {
+        if (a !== null) {
             return b;
         }
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 4 to equal 1

[Killed] BlockStatement
src/linkedList.js:212:25
             return b;
         }
 
-        if (b === null) {
-            return a;
-        }
+        if (b === null) {}
 
         if (a.getValue() <= b.getValue()) {
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:212:13
             return b;
         }
 
-        if (b === null) {
+        if (b !== null) {
             return a;
         }
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 3 to equal 1

[Killed] EqualityOperator
src/linkedList.js:216:13
             return a;
         }
 
-        if (a.getValue() <= b.getValue()) {
+        if (a.getValue() > b.getValue()) {
             result = a;
             result.setNext(LinkedList.sortedMerge(a.getNext(), b));
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 5 to equal 1

[Killed] ConditionalExpression
src/linkedList.js:216:13
             return a;
         }
 
-        if (a.getValue() <= b.getValue()) {
+        if (false) {
             result = a;
             result.setNext(LinkedList.sortedMerge(a.getNext(), b));
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 4 to equal 1

[Killed] BlockStatement
src/linkedList.js:219:16
         if (a.getValue() <= b.getValue()) {
             result = a;
             result.setNext(LinkedList.sortedMerge(a.getNext(), b));
-        } else {
-            result = b;
-            result.setNext(LinkedList.sortedMerge(a, b.getNext()));
-        }
+        } else {}
 
         this._head = result;
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:228:34
         return result;
     }
 
-    mergeSort(head = this._head) {
-        if (head === null || head.getNext() === null) {
-            return head;
-        }
-
-        let mid = this.findMid(head);
-        let midNext = mid.getNext();
-
-        mid.setNext(null);
-
-        let left = this.mergeSort(head);
-        let right = this.mergeSort(midNext);
-
-        let sortedList = LinkedList.sortedMerge(left, right);
-        this._head = sortedList;
-        return sortedList;
-    }
+    mergeSort(head = this._head) {}
 
     isEmpty() {
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 3 to equal 1

[Killed] EqualityOperator
src/linkedList.js:229:13
     }
 
     mergeSort(head = this._head) {
-        if (head === null || head.getNext() === null) {
+        if (head !== null || head.getNext() === null) {
             return head;
         }
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 3 to equal 1

[Killed] EqualityOperator
src/linkedList.js:229:30
     }
 
     mergeSort(head = this._head) {
-        if (head === null || head.getNext() === null) {
+        if (head === null || head.getNext() !== null) {
             return head;
         }
killedBy: linkedList tests .mergeSort() Sorting the unsorted list (without repetition)
statusReason: expected 3 to equal 1

[Killed] BlockStatement
src/linkedList.js:246:15
         return sortedList;
     }
 
-    isEmpty() {
-        return this._head === null;
-    }
+    isEmpty() {}
 
     clear() {
killedBy: linkedList tests .isEmpty() checks if the list is empty
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/linkedList.js:247:16
     }
 
     isEmpty() {
-        return this._head === null;
+        return true;
     }
 
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected 4 to equal 1

[Killed] ConditionalExpression
src/linkedList.js:247:16
     }
 
     isEmpty() {
-        return this._head === null;
+        return false;
     }
 
killedBy: linkedList tests .isEmpty() checks if the list is empty
statusReason: expected false to equal true

[Killed] BlockStatement
src/linkedList.js:250:13
         return this._head === null;
     }
 
-    clear() {
-        this._head = null;
-        this._count = 0;
-    }
+    clear() {}
 
     static fromArray(values) {
killedBy: linkedList tests .clear() Clearing a list
statusReason: expected LinkedListNode{ _value: 1, …(1) } to equal null

[Killed] BlockStatement
src/linkedList.js:255:30
         this._count = 0;
     }
 
-    static fromArray(values) {
-        if (!Array.isArray(values)) {
-            throw new Error('cannot create LinkedList from none-array values');
-        }
-
-        const linkedList = new LinkedList();
-        for (let i = 0; i < values.length; i++) {
-            linkedList.insertLast(values[i]);
-        }
-        return linkedList;
-    }
+    static fromArray(values) {}
 }
 
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] ConditionalExpression
src/linkedList.js:256:13
     }
 
     static fromArray(values) {
-        if (!Array.isArray(values)) {
+        if (false) {
             throw new Error('cannot create LinkedList from none-array values');
         }
killedBy: linkedList tests .fromArray() throws an error for invalid array
statusReason: expected TypeError: Cannot read properties of unde… to have property 'message' of 'cannot create LinkedList from none-ar…', but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/linkedList.js:256:37
     }
 
     static fromArray(values) {
-        if (!Array.isArray(values)) {
-            throw new Error('cannot create LinkedList from none-array values');
-        }
+        if (!Array.isArray(values)) {}
 
         const linkedList = new LinkedList();
killedBy: linkedList tests .fromArray() throws an error for invalid array
statusReason: expected TypeError: Cannot read properties of unde… to have property 'message' of 'cannot create LinkedList from none-ar…', but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/linkedList.js:261:25
         }
 
         const linkedList = new LinkedList();
-        for (let i = 0; i < values.length; i++) {
+        for (let i = 0; i >= values.length; i++) {
             linkedList.insertLast(values[i]);
         }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected +0 to equal 4

[Killed] ConditionalExpression
src/linkedList.js:261:25
         }
 
         const linkedList = new LinkedList();
-        for (let i = 0; i < values.length; i++) {
+        for (let i = 0; false; i++) {
             linkedList.insertLast(values[i]);
         }
killedBy: linkedList tests .fromArray() convert the array into linked list in same order
statusReason: expected +0 to equal 4

[Killed] ObjectLiteral
src/linkedList.js:268:18
     }
 }
 
-module.exports = { LinkedListNode, LinkedList };
+module.exports = {};
 
killedBy: linkedList tests .head() get the head node
statusReason: LinkedList is not a constructor
