[Killed] ArrayDeclaration
src/queue.js:3:63
 class Queue {
     constructor(elements) {
-        this._elements = Array.isArray(elements) ? elements : [];
+        this._elements = Array.isArray(elements) ? elements : ["Stryker was here"];
         this._offset = 0;
     }
killedBy: Queue tests new Queue() should be empty
statusReason: expected false to equal true

[Killed] BlockStatement
src/queue.js:7:32
         this._offset = 0;
     }
 
-    static fromArray(elements) {
-        return new Queue(elements);
-    }
+    static fromArray(elements) {}
 
     enqueue(element) {
killedBy: Queue tests .fromArray(list) creates a queue from an existing array
statusReason: Cannot read properties of undefined (reading 'front')

[Killed] BlockStatement
src/queue.js:11:22
         return new Queue(elements);
     }
 
-    enqueue(element) {
-        this._elements.push(element);
-        return this;
-    }
+    enqueue(element) {}
 
     reverse() {
killedBy: Queue tests .enqueue(element) should assert size to be 3
statusReason: expected +0 to equal 3

[Killed] BlockStatement
src/queue.js:16:15
         return this;
     }
 
-    reverse() {
-        let stack = [];
-        while (this._elements.length > 0) {
-            stack.push(this._elements[0]);
-            this._elements.shift();
-        }
-        while (stack.length > 0) {
-            this._elements.push(stack[stack.length - 1]);
-            stack.pop();
-        }
-    }
+    reverse() {}
 
     push(element) {
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 1, 2, 3, 4 ] to deeply equal [ 4, 3, 2, 1 ]

[Killed] ArrayDeclaration
src/queue.js:17:21
     }
 
     reverse() {
-        let stack = [];
+        let stack = ["Stryker was here"];
         while (this._elements.length > 0) {
             stack.push(this._elements[0]);
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] ConditionalExpression
src/queue.js:18:16
 
     reverse() {
         let stack = [];
-        while (this._elements.length > 0) {
+        while (false) {
             stack.push(this._elements[0]);
             this._elements.shift();
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 1, 2, 3, 4 ] to deeply equal [ 4, 3, 2, 1 ]

[Killed] EqualityOperator
src/queue.js:18:16
 
     reverse() {
         let stack = [];
-        while (this._elements.length > 0) {
+        while (this._elements.length >= 0) {
             stack.push(this._elements[0]);
             this._elements.shift();
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] EqualityOperator
src/queue.js:22:16
             stack.push(this._elements[0]);
             this._elements.shift();
         }
-        while (stack.length > 0) {
+        while (stack.length <= 0) {
             this._elements.push(stack[stack.length - 1]);
             stack.pop();
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [] to deeply equal [ 4, 3, 2, 1 ]

[Killed] EqualityOperator
src/queue.js:22:16
             stack.push(this._elements[0]);
             this._elements.shift();
         }
-        while (stack.length > 0) {
+        while (stack.length >= 0) {
             this._elements.push(stack[stack.length - 1]);
             stack.pop();
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] ArithmeticOperator
src/queue.js:23:39
             this._elements.shift();
         }
         while (stack.length > 0) {
-            this._elements.push(stack[stack.length - 1]);
+            this._elements.push(stack[stack.length + 1]);
             stack.pop();
         }
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] BlockStatement
src/queue.js:28:19
         }
     }
 
-    push(element) {
-        return this.enqueue(element);
-    }
+    push(element) {}
 
     sort() {
killedBy: Queue tests .enqueue(element) should enqueue 3 elements to the stack
statusReason: Cannot read properties of undefined (reading 'enqueue')

[Killed] BlockStatement
src/queue.js:32:12
         return this.enqueue(element);
     }
 
-    sort() {
-        this._elements = this._elements.sort();
-    }
+    sort() {}
 
     dequeue() {
killedBy: Queue tests .sort() sort the queue
statusReason: expected [ 5, 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] MethodExpression
src/queue.js:33:26
     }
 
     sort() {
-        this._elements = this._elements.sort();
+        this._elements = this._elements;
     }
 
killedBy: Queue tests .sort() sort the queue
statusReason: expected [ 5, 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4, 5 ]

[Killed] BlockStatement
src/queue.js:36:15
         this._elements = this._elements.sort();
     }
 
-    dequeue() {
-        if (this.size() === 0) return null;
-
-        const first = this.front();
-        this._offset += 1;
-
-        if (this._offset * 2 < this._elements.length) return first;
-
-        this._elements = this._elements.slice(this._offset);
-        this._offset = 0;
-        return first;
-    }
+    dequeue() {}
 
     pop() {
killedBy: Queue tests .clone() clone
statusReason: expected null to equal 3

[Killed] EqualityOperator
src/queue.js:37:13
     }
 
     dequeue() {
-        if (this.size() === 0) return null;
+        if (this.size() !== 0) return null;
 
         const first = this.front();
killedBy: Queue tests .clone() clone
statusReason: expected null to equal 3

[Killed] ConditionalExpression
src/queue.js:37:13
     }
 
     dequeue() {
-        if (this.size() === 0) return null;
+        if (true) return null;
 
         const first = this.front();
killedBy: Queue tests .clone() clone
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] AssignmentOperator
src/queue.js:40:9
         if (this.size() === 0) return null;
 
         const first = this.front();
-        this._offset += 1;
+        this._offset -= 1;
 
         if (this._offset * 2 < this._elements.length) return first;
killedBy: Queue tests .clone() clone
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] ConditionalExpression
src/queue.js:42:13
         const first = this.front();
         this._offset += 1;
 
-        if (this._offset * 2 < this._elements.length) return first;
+        if (false) return first;
 
         this._elements = this._elements.slice(this._offset);
killedBy: Queue tests .clone() clone
statusReason: expected null to equal 3

[Killed] ArithmeticOperator
src/queue.js:42:13
         const first = this.front();
         this._offset += 1;
 
-        if (this._offset * 2 < this._elements.length) return first;
+        if (this._offset / 2 < this._elements.length) return first;
 
         this._elements = this._elements.slice(this._offset);
killedBy: Queue tests .clone() clone
statusReason: expected null to equal 3

[Killed] MethodExpression
src/queue.js:44:26
 
         if (this._offset * 2 < this._elements.length) return first;
 
-        this._elements = this._elements.slice(this._offset);
+        this._elements = this._elements;
         this._offset = 0;
         return first;
killedBy: Queue tests .clone() clone
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] BlockStatement
src/queue.js:49:11
         return first;
     }
 
-    pop() {
-        return this.dequeue();
-    }
+    pop() {}
 
     front() {
killedBy: Queue tests dequeue() dequeue all elements
statusReason: expected null to equal 2

[Killed] BlockStatement
src/queue.js:53:13
         return this.dequeue();
     }
 
-    front() {
-        return this.size() > 0 ? this._elements[this._offset] : null;
-    }
+    front() {}
 
     reverseFirstK(k) {
killedBy: Queue tests .fromArray(list) creates a queue from an existing array
statusReason: expected undefined to equal 3

[Killed] ConditionalExpression
src/queue.js:54:16
     }
 
     front() {
-        return this.size() > 0 ? this._elements[this._offset] : null;
+        return true ? this._elements[this._offset] : null;
     }
 
killedBy: Queue tests .front() should get the front
statusReason: Cannot read properties of undefined (reading 'front')

[Killed] ConditionalExpression
src/queue.js:54:16
     }
 
     front() {
-        return this.size() > 0 ? this._elements[this._offset] : null;
+        return false ? this._elements[this._offset] : null;
     }
 
killedBy: Queue tests .fromArray(list) creates a queue from an existing array
statusReason: expected null to equal 3

[Killed] BlockStatement
src/queue.js:57:22
         return this.size() > 0 ? this._elements[this._offset] : null;
     }
 
-    reverseFirstK(k) {
-        if (this._elements.length == 0 || k > this._elements.length)
-            return false;
-        if (k <= 0) return false;
-        let Stack = [];
-        for (let i = 0; i < k; i++) {
-            Stack.push(this._elements.shift());
-        }
-        while (Stack.length > 0) {
-            this._elements.push(Stack.pop());
-        }
-        for (let i = 0; i < this._elements.length - k; i++) {
-            this._elements.push(this._elements.shift());
-        }
-        return true;
-    }
+    reverseFirstK(k) {}
 
     back() {
killedBy: Queue tests .reverseFirstK() should return false for empty array
statusReason: expected undefined to equal false

[Killed] EqualityOperator
src/queue.js:58:13
     }
 
     reverseFirstK(k) {
-        if (this._elements.length == 0 || k > this._elements.length)
+        if (this._elements.length != 0 || k > this._elements.length)
             return false;
         if (k <= 0) return false;
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/queue.js:58:13
     }
 
     reverseFirstK(k) {
-        if (this._elements.length == 0 || k > this._elements.length)
+        if (false)
             return false;
         if (k <= 0) return false;
killedBy: Queue tests .reverseFirstK() should return false for empty array
statusReason: expected true to equal false

[Killed] BooleanLiteral
src/queue.js:59:20
 
     reverseFirstK(k) {
         if (this._elements.length == 0 || k > this._elements.length)
-            return false;
+            return true;
         if (k <= 0) return false;
         let Stack = [];
killedBy: Queue tests .reverseFirstK() should return false for empty array
statusReason: expected true to equal false

[Killed] EqualityOperator
src/queue.js:60:13
     reverseFirstK(k) {
         if (this._elements.length == 0 || k > this._elements.length)
             return false;
-        if (k <= 0) return false;
+        if (k > 0) return false;
         let Stack = [];
         for (let i = 0; i < k; i++) {
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/queue.js:60:13
     reverseFirstK(k) {
         if (this._elements.length == 0 || k > this._elements.length)
             return false;
-        if (k <= 0) return false;
+        if (true) return false;
         let Stack = [];
         for (let i = 0; i < k; i++) {
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected false to equal true

[Killed] ArrayDeclaration
src/queue.js:61:21
         if (this._elements.length == 0 || k > this._elements.length)
             return false;
         if (k <= 0) return false;
-        let Stack = [];
+        let Stack = ["Stryker was here"];
         for (let i = 0; i < k; i++) {
             Stack.push(this._elements.shift());
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 40, 30, 20, 10, …(7) ] to deeply equal [ Array(10) ]

[Killed] EqualityOperator
src/queue.js:62:25
             return false;
         if (k <= 0) return false;
         let Stack = [];
-        for (let i = 0; i < k; i++) {
+        for (let i = 0; i <= k; i++) {
             Stack.push(this._elements.shift());
         }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ Array(10) ] to deeply equal [ Array(10) ]

[Killed] ConditionalExpression
src/queue.js:62:25
             return false;
         if (k <= 0) return false;
         let Stack = [];
-        for (let i = 0; i < k; i++) {
+        for (let i = 0; false; i++) {
             Stack.push(this._elements.shift());
         }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 60, 70, 80, 90, 100, 10, 20, …(3) ] to deeply equal [ Array(10) ]

[Killed] ConditionalExpression
src/queue.js:65:16
         for (let i = 0; i < k; i++) {
             Stack.push(this._elements.shift());
         }
-        while (Stack.length > 0) {
+        while (false) {
             this._elements.push(Stack.pop());
         }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 60, 70, 80, 90, 100 ] to deeply equal [ Array(10) ]

[Killed] EqualityOperator
src/queue.js:65:16
         for (let i = 0; i < k; i++) {
             Stack.push(this._elements.shift());
         }
-        while (Stack.length > 0) {
+        while (Stack.length <= 0) {
             this._elements.push(Stack.pop());
         }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 60, 70, 80, 90, 100 ] to deeply equal [ Array(10) ]

[Killed] EqualityOperator
src/queue.js:68:25
         while (Stack.length > 0) {
             this._elements.push(Stack.pop());
         }
-        for (let i = 0; i < this._elements.length - k; i++) {
+        for (let i = 0; i >= this._elements.length - k; i++) {
             this._elements.push(this._elements.shift());
         }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 60, 70, 80, 90, 100, 50, 40, …(3) ] to deeply equal [ Array(10) ]

[Killed] BlockStatement
src/queue.js:68:61
         while (Stack.length > 0) {
             this._elements.push(Stack.pop());
         }
-        for (let i = 0; i < this._elements.length - k; i++) {
-            this._elements.push(this._elements.shift());
-        }
+        for (let i = 0; i < this._elements.length - k; i++) {}
         return true;
     }
killedBy: Queue tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ 60, 70, 80, 90, 100, 50, 40, …(3) ] to deeply equal [ Array(10) ]

[Killed] BlockStatement
src/queue.js:74:12
         return true;
     }
 
-    back() {
-        return this.size() > 0
-            ? this._elements[this._elements.length - 1]
-            : null;
-    }
+    back() {}
 
     size() {
killedBy: Queue tests .back() back element
statusReason: Cannot read properties of undefined (reading 'back')

[Killed] EqualityOperator
src/queue.js:75:16
     }
 
     back() {
-        return this.size() > 0
+        return this.size() <= 0
             ? this._elements[this._elements.length - 1]
             : null;
killedBy: Queue tests .back() back element
statusReason: Cannot read properties of undefined (reading 'back')

[Killed] ConditionalExpression
src/queue.js:75:16
     }
 
     back() {
-        return this.size() > 0
+        return false
             ? this._elements[this._elements.length - 1]
             : null;
killedBy: Queue tests .back() back element
statusReason: Cannot read properties of undefined (reading 'back')

[Killed] ArithmeticOperator
src/queue.js:76:30
 
     back() {
         return this.size() > 0
-            ? this._elements[this._elements.length - 1]
+            ? this._elements[this._elements.length + 1]
             : null;
     }
killedBy: Queue tests .back() back element
statusReason: Cannot read properties of undefined (reading 'back')

[Killed] BlockStatement
src/queue.js:80:12
             : null;
     }
 
-    size() {
-        return this._elements.length - this._offset;
-    }
+    size() {}
 
     clone() {
killedBy: Queue tests new Queue() should be empty
statusReason: expected false to equal true

[Killed] ArithmeticOperator
src/queue.js:81:16
     }
 
     size() {
-        return this._elements.length - this._offset;
+        return this._elements.length + this._offset;
     }
 
killedBy: Queue tests new Queue() should be empty
statusReason: Cannot read properties of undefined (reading 'isEmpty')

[Killed] BlockStatement
src/queue.js:84:13
         return this._elements.length - this._offset;
     }
 
-    clone() {
-        return new Queue(this._elements.slice(this._offset));
-    }
+    clone() {}
 
     isEmpty() {
killedBy: Queue tests .clone() clone
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] MethodExpression
src/queue.js:85:26
     }
 
     clone() {
-        return new Queue(this._elements.slice(this._offset));
+        return new Queue(this._elements);
     }
 
killedBy: Queue tests .clone() clone
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] BlockStatement
src/queue.js:88:15
         return new Queue(this._elements.slice(this._offset));
     }
 
-    isEmpty() {
-        return this.size() === 0;
-    }
+    isEmpty() {}
 
     toArray() {
killedBy: Queue tests new Queue() should be empty
statusReason: expected undefined to equal true

[Killed] ConditionalExpression
src/queue.js:89:16
     }
 
     isEmpty() {
-        return this.size() === 0;
+        return true;
     }
 
killedBy: Queue tests new Queue() should be empty
statusReason: Cannot read properties of undefined (reading 'isEmpty')

[Killed] ConditionalExpression
src/queue.js:89:16
     }
 
     isEmpty() {
-        return this.size() === 0;
+        return false;
     }
 
killedBy: Queue tests new Queue() should be empty
statusReason: Cannot read properties of undefined (reading 'isEmpty')

[Killed] BlockStatement
src/queue.js:92:15
         return this.size() === 0;
     }
 
-    toArray() {
-        return this._elements.slice(this._offset);
-    }
+    toArray() {}
 
     clear() {
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected undefined to deeply equal [ 1, 2, 3, 4 ]

[Killed] MethodExpression
src/queue.js:93:16
     }
 
     toArray() {
-        return this._elements.slice(this._offset);
+        return this._elements;
     }
 
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] BlockStatement
src/queue.js:96:13
         return this._elements.slice(this._offset);
     }
 
-    clear() {
-        this._elements = [];
-        this._offset = 0;
-    }
+    clear() {}
 
     interleave() {
killedBy: Queue tests .clear() clear the queue
statusReason: Cannot read properties of undefined (reading 'enqueue')

[Killed] BlockStatement
src/queue.js:101:18
         this._offset = 0;
     }
 
-    interleave() {
-        if (this._elements.length % 2 != 0) return false;
-        let temp = [];
-        let halfSize = this._elements.length / 2;
-        for (let i = 0; i < halfSize; i++) {
-            temp.push(this._elements[0]);
-            this._elements.shift();
-        }
-        while (temp.length != 0) {
-            this._elements.push(temp[0]);
-            this._elements.push(this._elements[0]);
-            this._elements.shift();
-            temp.shift();
-        }
-        return true;
-    }
+    interleave() {}
 }
 
killedBy: Queue tests .interleave() should abort operations on an odd length queue
statusReason: expected undefined to equal false

[Killed] EqualityOperator
src/queue.js:102:13
     }
 
     interleave() {
-        if (this._elements.length % 2 != 0) return false;
+        if (this._elements.length % 2 == 0) return false;
         let temp = [];
         let halfSize = this._elements.length / 2;
killedBy: Queue tests .interleave() should abort operations on an odd length queue
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/queue.js:102:13
     }
 
     interleave() {
-        if (this._elements.length % 2 != 0) return false;
+        if (false) return false;
         let temp = [];
         let halfSize = this._elements.length / 2;
killedBy: Queue tests .interleave() should abort operations on an odd length queue
statusReason: expected true to equal false

[Killed] ArithmeticOperator
src/queue.js:104:24
     interleave() {
         if (this._elements.length % 2 != 0) return false;
         let temp = [];
-        let halfSize = this._elements.length / 2;
+        let halfSize = this._elements.length * 2;
         for (let i = 0; i < halfSize; i++) {
             temp.push(this._elements[0]);
killedBy: Queue tests .interleave() should interleave elements of odd and even positions
statusReason: expected [ undefined, 2, undefined, 3, …(4) ] to deeply equal [ 1, 3, 2, 4 ]

[Killed] ConditionalExpression
src/queue.js:105:25
         if (this._elements.length % 2 != 0) return false;
         let temp = [];
         let halfSize = this._elements.length / 2;
-        for (let i = 0; i < halfSize; i++) {
+        for (let i = 0; false; i++) {
             temp.push(this._elements[0]);
             this._elements.shift();
killedBy: Queue tests .interleave() should interleave elements of odd and even positions
statusReason: expected [ 1, 2, 3, 4 ] to deeply equal [ 1, 3, 2, 4 ]

[Killed] BlockStatement
src/queue.js:105:44
         if (this._elements.length % 2 != 0) return false;
         let temp = [];
         let halfSize = this._elements.length / 2;
-        for (let i = 0; i < halfSize; i++) {
-            temp.push(this._elements[0]);
-            this._elements.shift();
-        }
+        for (let i = 0; i < halfSize; i++) {}
         while (temp.length != 0) {
             this._elements.push(temp[0]);
killedBy: Queue tests .interleave() should interleave elements of odd and even positions
statusReason: expected false to equal true

[Killed] ConditionalExpression
src/queue.js:109:16
             temp.push(this._elements[0]);
             this._elements.shift();
         }
-        while (temp.length != 0) {
+        while (false) {
             this._elements.push(temp[0]);
             this._elements.push(this._elements[0]);
killedBy: Queue tests .interleave() should interleave elements of odd and even positions
statusReason: expected false to equal true

[Killed] BlockStatement
src/queue.js:109:34
             temp.push(this._elements[0]);
             this._elements.shift();
         }
-        while (temp.length != 0) {
-            this._elements.push(temp[0]);
-            this._elements.push(this._elements[0]);
-            this._elements.shift();
-            temp.shift();
-        }
+        while (temp.length != 0) {}
         return true;
     }
killedBy: Queue tests .interleave() should interleave elements of odd and even positions
statusReason: expected [] to deeply equal [ 1, 3, 2, 4 ]
