[Killed] BlockStatement
src/stack.js:2:24
 class Stack {
-    constructor(input) {
-        this._stackElements = [];
-        if (input instanceof Array) {
-            this._stackElements = input;
-        }
-    }
+    constructor(input) {}
 
     printNGE(arr = this._stackElements, n = this._stackElements.length) {
killedBy: stack tests .push(element) push elements to the top 
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/stack.js:4:37
 class Stack {
     constructor(input) {
         this._stackElements = [];
-        if (input instanceof Array) {
-            this._stackElements = input;
-        }
+        if (input instanceof Array) {}
     }
 
killedBy: stack tests Stack.fromArray(list) creates a stack from an existing array
statusReason: expected null to equal 3

[Killed] ConditionalExpression
src/stack.js:4:13
 class Stack {
     constructor(input) {
         this._stackElements = [];
-        if (input instanceof Array) {
+        if (false) {
             this._stackElements = input;
         }
killedBy: stack tests Stack.fromArray(list) creates a stack from an existing array
statusReason: expected null to equal 3

[Killed] BlockStatement
src/stack.js:9:73
         }
     }
 
-    printNGE(arr = this._stackElements, n = this._stackElements.length) {
-        let s = [];
-        const res = {};
-        s.push(arr[0]);
-        for (var i = 1; i < n; i++) {
-            if (s.length == 0) {
-                s.push(arr[i]);
-                continue;
-            }
-            while ((s.length == 0) == false && s[s.length - 1] < arr[i]) {
-                res[`${s[s.length - 1]}`] = arr[i];
-                s.pop();
-            }
-            s.push(arr[i]);
-        }
-        while (s.length != 0) {
-            res[`${s[s.length - 1]}`] = -1;
-            s.pop();
-        }
-        return res;
-    }
+    printNGE(arr = this._stackElements, n = this._stackElements.length) {}
 
     peek() {
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected undefined to deeply equal { Object (1, 2, ...) }

[Killed] ConditionalExpression
src/stack.js:13:25
         let s = [];
         const res = {};
         s.push(arr[0]);
-        for (var i = 1; i < n; i++) {
+        for (var i = 1; false; i++) {
             if (s.length == 0) {
                 s.push(arr[i]);
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1 } to deeply equal { Object (1, 2, ...) }

[Killed] BlockStatement
src/stack.js:13:37
         let s = [];
         const res = {};
         s.push(arr[0]);
-        for (var i = 1; i < n; i++) {
-            if (s.length == 0) {
-                s.push(arr[i]);
-                continue;
-            }
-            while ((s.length == 0) == false && s[s.length - 1] < arr[i]) {
-                res[`${s[s.length - 1]}`] = arr[i];
-                s.pop();
-            }
-            s.push(arr[i]);
-        }
+        for (var i = 1; i < n; i++) {}
         while (s.length != 0) {
             res[`${s[s.length - 1]}`] = -1;
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1 } to deeply equal { Object (1, 2, ...) }

[Killed] ConditionalExpression
src/stack.js:14:17
         const res = {};
         s.push(arr[0]);
         for (var i = 1; i < n; i++) {
-            if (s.length == 0) {
+            if (true) {
                 s.push(arr[i]);
                 continue;
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1, '2': -1, '3': -1, …(2) } to deeply equal { Object (1, 2, ...) }

[Killed] EqualityOperator
src/stack.js:14:17
         const res = {};
         s.push(arr[0]);
         for (var i = 1; i < n; i++) {
-            if (s.length == 0) {
+            if (s.length != 0) {
                 s.push(arr[i]);
                 continue;
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1, '2': -1, '3': -1, …(2) } to deeply equal { Object (1, 2, ...) }

[Killed] ArithmeticOperator
src/stack.js:18:50
                 s.push(arr[i]);
                 continue;
             }
-            while ((s.length == 0) == false && s[s.length - 1] < arr[i]) {
+            while ((s.length == 0) == false && s[s.length + 1] < arr[i]) {
                 res[`${s[s.length - 1]}`] = arr[i];
                 s.pop();
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1, '2': -1, '3': -1, …(2) } to deeply equal { Object (1, 2, ...) }

[Killed] ConditionalExpression
src/stack.js:18:20
                 s.push(arr[i]);
                 continue;
             }
-            while ((s.length == 0) == false && s[s.length - 1] < arr[i]) {
+            while (false) {
                 res[`${s[s.length - 1]}`] = arr[i];
                 s.pop();
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': -1, '2': -1, '3': -1, …(2) } to deeply equal { Object (1, 2, ...) }

[Killed] ArithmeticOperator
src/stack.js:19:26
                 continue;
             }
             while ((s.length == 0) == false && s[s.length - 1] < arr[i]) {
-                res[`${s[s.length - 1]}`] = arr[i];
+                res[`${s[s.length + 1]}`] = arr[i];
                 s.pop();
             }
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '5': -1, undefined: 5 } to deeply equal { Object (1, 2, ...) }

[Killed] EqualityOperator
src/stack.js:24:16
             }
             s.push(arr[i]);
         }
-        while (s.length != 0) {
+        while (s.length == 0) {
             res[`${s[s.length - 1]}`] = -1;
             s.pop();
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': 2, '2': 3, '3': 4, '4': 5 } to deeply equal { Object (1, 2, ...) }

[Killed] ConditionalExpression
src/stack.js:24:16
             }
             s.push(arr[i]);
         }
-        while (s.length != 0) {
+        while (false) {
             res[`${s[s.length - 1]}`] = -1;
             s.pop();
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { '1': 2, '2': 3, '3': 4, '4': 5 } to deeply equal { Object (1, 2, ...) }

[Killed] UnaryOperator
src/stack.js:25:41
             s.push(arr[i]);
         }
         while (s.length != 0) {
-            res[`${s[s.length - 1]}`] = -1;
+            res[`${s[s.length - 1]}`] = +1;
             s.pop();
         }
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { Object (1, 2, ...) } to deeply equal { Object (1, 2, ...) }

[Killed] ArithmeticOperator
src/stack.js:25:22
             s.push(arr[i]);
         }
         while (s.length != 0) {
-            res[`${s[s.length - 1]}`] = -1;
+            res[`${s[s.length + 1]}`] = -1;
             s.pop();
         }
killedBy: stack tests Stack Next Greater Element to the right prints the next greater array
statusReason: expected { Object (1, 2, ...) } to deeply equal { Object (1, 2, ...) }

[Killed] BlockStatement
src/stack.js:31:12
         return res;
     }
 
-    peek() {
-        return this.isEmpty()
-            ? null
-            : this._stackElements[this._stackElements.length - 1];
-    }
+    peek() {}
 
     push(value) {
killedBy: stack tests .peek() top element
statusReason: expected undefined to equal 3

[Killed] ArithmeticOperator
src/stack.js:34:35
     peek() {
         return this.isEmpty()
             ? null
-            : this._stackElements[this._stackElements.length - 1];
+            : this._stackElements[this._stackElements.length + 1];
     }
 
killedBy: stack tests .peek() top element
statusReason: expected undefined to equal 3

[Killed] BlockStatement
src/stack.js:37:17
             : this._stackElements[this._stackElements.length - 1];
     }
 
-    push(value) {
-        this._stackElements.push(value);
-        return this;
-    }
+    push(value) {}
 
     computeHistogram(histogram = this._stackElements) {
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected +0 to equal 12

[Killed] ArrayDeclaration
src/stack.js:43:21
     }
 
     computeHistogram(histogram = this._stackElements) {
-        let stack = [];
+        let stack = ["Stryker was here"];
         let max_area = 0;
         let index = 0;
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] EqualityOperator
src/stack.js:46:16
         let stack = [];
         let max_area = 0;
         let index = 0;
-        while (index < histogram.length) {
+        while (index <= histogram.length) {
             if (
                 stack.length == 0 ||
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] EqualityOperator
src/stack.js:46:16
         let stack = [];
         let max_area = 0;
         let index = 0;
-        while (index < histogram.length) {
+        while (index >= histogram.length) {
             if (
                 stack.length == 0 ||
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected +0 to equal 12

[Killed] ConditionalExpression
src/stack.js:48:17
         let index = 0;
         while (index < histogram.length) {
             if (
-                stack.length == 0 ||
-                histogram[stack[stack.length - 1]] <= histogram[index]
+                true
             ) {
                 stack.push(index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 126 to equal 12

[Timeout] ConditionalExpression
src/stack.js:48:17
         let index = 0;
         while (index < histogram.length) {
             if (
-                stack.length == 0 ||
-                histogram[stack[stack.length - 1]] <= histogram[index]
+                false
             ) {
                 stack.push(index);

[Killed] ArithmeticOperator
src/stack.js:49:33
         while (index < histogram.length) {
             if (
                 stack.length == 0 ||
-                histogram[stack[stack.length - 1]] <= histogram[index]
+                histogram[stack[stack.length + 1]] <= histogram[index]
             ) {
                 stack.push(index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 168 to equal 12

[Killed] ConditionalExpression
src/stack.js:49:17
         while (index < histogram.length) {
             if (
                 stack.length == 0 ||
-                histogram[stack[stack.length - 1]] <= histogram[index]
+                false
             ) {
                 stack.push(index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 210 to equal 12

[Timeout] BlockStatement
src/stack.js:50:15
             if (
                 stack.length == 0 ||
                 histogram[stack[stack.length - 1]] <= histogram[index]
-            ) {
-                stack.push(index);
-                index += 1;
-            } else {
+            ) {} else {
                 let top_of_stack = stack.pop();
                 let area =

[Timeout] AssignmentOperator
src/stack.js:52:17
                 histogram[stack[stack.length - 1]] <= histogram[index]
             ) {
                 stack.push(index);
-                index += 1;
+                index -= 1;
             } else {
                 let top_of_stack = stack.pop();

[Timeout] BlockStatement
src/stack.js:53:20
             ) {
                 stack.push(index);
                 index += 1;
-            } else {
-                let top_of_stack = stack.pop();
-                let area =
-                    histogram[top_of_stack] *
-                    (stack.length > 0
-                        ? index - stack[stack.length - 1] - 1
-                        : index);
-                max_area = Math.max(max_area, area);
-            }
+            } else {}
         }
         while (stack.length > 0) {

[Killed] ArithmeticOperator
src/stack.js:56:21
             } else {
                 let top_of_stack = stack.pop();
                 let area =
-                    histogram[top_of_stack] *
-                    (stack.length > 0
-                        ? index - stack[stack.length - 1] - 1
-                        : index);
+                    histogram[top_of_stack] / (stack.length > 0 ? index - stack[stack.length - 1] - 1 : index);
                 max_area = Math.max(max_area, area);
             }
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 56 to equal 12

[Killed] EqualityOperator
src/stack.js:57:22
                 let top_of_stack = stack.pop();
                 let area =
                     histogram[top_of_stack] *
-                    (stack.length > 0
+                    (stack.length <= 0
                         ? index - stack[stack.length - 1] - 1
                         : index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] ConditionalExpression
src/stack.js:57:22
                 let top_of_stack = stack.pop();
                 let area =
                     histogram[top_of_stack] *
-                    (stack.length > 0
+                    (true
                         ? index - stack[stack.length - 1] - 1
                         : index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] ArithmeticOperator
src/stack.js:58:41
                 let area =
                     histogram[top_of_stack] *
                     (stack.length > 0
-                        ? index - stack[stack.length - 1] - 1
+                        ? index - stack[stack.length + 1] - 1
                         : index);
                 max_area = Math.max(max_area, area);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] ArithmeticOperator
src/stack.js:58:27
                 let area =
                     histogram[top_of_stack] *
                     (stack.length > 0
-                        ? index - stack[stack.length - 1] - 1
+                        ? index - stack[stack.length - 1] + 1
                         : index);
                 max_area = Math.max(max_area, area);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 49 to equal 12

[Timeout] BlockStatement
src/stack.js:63:34
                 max_area = Math.max(max_area, area);
             }
         }
-        while (stack.length > 0) {
-            let top_of_stack = stack.pop();
-            let area =
-                histogram[top_of_stack] *
-                (stack.length > 0
-                    ? index - stack[stack.length - 1] - 1
-                    : index);
-            max_area = Math.max(max_area, area);
-        }
+        while (stack.length > 0) {}
         return max_area;
     }

[Survived] ConditionalExpression
src/stack.js:63:16
                 max_area = Math.max(max_area, area);
             }
         }
-        while (stack.length > 0) {
+        while (false) {
             let top_of_stack = stack.pop();
             let area =

[Killed] EqualityOperator
src/stack.js:67:18
             let top_of_stack = stack.pop();
             let area =
                 histogram[top_of_stack] *
-                (stack.length > 0
+                (stack.length >= 0
                     ? index - stack[stack.length - 1] - 1
                     : index);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected NaN to equal 12

[Killed] ArithmeticOperator
src/stack.js:68:23
             let area =
                 histogram[top_of_stack] *
                 (stack.length > 0
-                    ? index - stack[stack.length - 1] - 1
+                    ? index + stack[stack.length - 1] - 1
                     : index);
             max_area = Math.max(max_area, area);
killedBy: stack tests .histogram() compute the max rectangular area correctly
statusReason: expected 1326 to equal 12

[Killed] BlockStatement
src/stack.js:75:11
         return max_area;
     }
 
-    pop() {
-        return this.isEmpty() ? null : this._stackElements.pop();
-    }
+    pop() {}
 
     slidingMaxOfKSubarrays(k) {
killedBy: stack tests .pop() pop the elements
statusReason: expected undefined to equal 3

[Killed] ConditionalExpression
src/stack.js:86:25
         let max_upto = new Array(n);
         let s = [];
         s.push(0);
-        for (let i = 1; i < n; i++) {
+        for (let i = 1; false; i++) {
             while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
                 max_upto[s[s.length - 1]] = i - 1;
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 2, 4, 6, 8, 2, 1, 5, 9, …(15) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] EqualityOperator
src/stack.js:86:25
         let max_upto = new Array(n);
         let s = [];
         s.push(0);
-        for (let i = 1; i < n; i++) {
+        for (let i = 1; i <= n; i++) {
             while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
                 max_upto[s[s.length - 1]] = i - 1;
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 6, 8, 8, 8, 5, 9, 9, 9, …(6) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ConditionalExpression
src/stack.js:87:37
         let s = [];
         s.push(0);
         for (let i = 1; i < n; i++) {
-            while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
+            while (s.length != 0 && true) {
                 max_upto[s[s.length - 1]] = i - 1;
                 s.pop();
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 2, 4, 6, 8, 2, 1, 5, 9, 7, 2, …(24) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:87:41
         let s = [];
         s.push(0);
         for (let i = 1; i < n; i++) {
-            while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
+            while (s.length != 0 && a[s[s.length + 1]] < a[i]) {
                 max_upto[s[s.length - 1]] = i - 1;
                 s.pop();
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 2, 4, 6, 8, 2 ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:88:28
         s.push(0);
         for (let i = 1; i < n; i++) {
             while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
-                max_upto[s[s.length - 1]] = i - 1;
+                max_upto[s[s.length + 1]] = i - 1;
                 s.pop();
             }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 2, 4, 6, 8, 2, 1, 5, 9, …(42) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:88:45
         s.push(0);
         for (let i = 1; i < n; i++) {
             while (s.length != 0 && a[s[s.length - 1]] < a[i]) {
-                max_upto[s[s.length - 1]] = i - 1;
+                max_upto[s[s.length - 1]] = i + 1;
                 s.pop();
             }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 2, 4, 6, 8, 2, 1, 5, 9, …(60) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:94:24
             s.push(i);
         }
         while (s.length != 0) {
-            max_upto[s[s.length - 1]] = n - 1;
+            max_upto[s[s.length + 1]] = n - 1;
             s.pop();
         }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 6, 8, 8, 8, 5, 9, 9, 9, …(51) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:94:41
             s.push(i);
         }
         while (s.length != 0) {
-            max_upto[s[s.length - 1]] = n - 1;
+            max_upto[s[s.length - 1]] = n + 1;
             s.pop();
         }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 6, 8, 8, 8, 5, 9, 9, 9, …(60) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] BlockStatement
src/stack.js:98:42
             s.pop();
         }
         let j = 0;
-        for (let i = 0; i <= n - k; i++) {
-            while (j < i || max_upto[j] < i + k - 1) {
-                j++;
-            }
-            res.push(a[j]);
-        }
+        for (let i = 0; i <= n - k; i++) {}
         return res;
     }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:98:30
             s.pop();
         }
         let j = 0;
-        for (let i = 0; i <= n - k; i++) {
+        for (let i = 0; i <= n + k; i++) {
             while (j < i || max_upto[j] < i + k - 1) {
                 j++;
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ 9, 7, 6, 8, 8, 8, 5, 9, 9, 9, …(93) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] ArithmeticOperator
src/stack.js:99:43
         }
         let j = 0;
         for (let i = 0; i <= n - k; i++) {
-            while (j < i || max_upto[j] < i + k - 1) {
+            while (j < i || max_upto[j] < i - k - 1) {
                 j++;
             }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ Array(115) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Killed] EqualityOperator
src/stack.js:99:20
         }
         let j = 0;
         for (let i = 0; i <= n - k; i++) {
-            while (j < i || max_upto[j] < i + k - 1) {
+            while (j <= i || max_upto[j] < i + k - 1) {
                 j++;
             }
killedBy: stack tests .slidingMaxOfKSubarrays() reverses the stack using a shallow copy
statusReason: expected [ Array(115) ] to deeply equal [ 9, 7, 6, 8, 8, 8, 5 ]

[Timeout] UpdateOperator
src/stack.js:100:17
         let j = 0;
         for (let i = 0; i <= n - k; i++) {
             while (j < i || max_upto[j] < i + k - 1) {
-                j++;
+                j--;
             }
             res.push(a[j]);

[Killed] BlockStatement
src/stack.js:107:32
         return res;
     }
 
-    static fromArray(elements) {
-        return new Stack(elements);
-    }
+    static fromArray(elements) {}
 
     toArray() {
killedBy: stack tests Stack.fromArray(list) creates a stack from an existing array
statusReason: Cannot read properties of undefined (reading 'peek')

[Killed] BlockStatement
src/stack.js:111:15
         return new Stack(elements);
     }
 
-    toArray() {
-        return this._stackElements.slice();
-    }
+    toArray() {}
 
     sortStack(input = this._stackElements) {
killedBy: stack tests .toArray() should be non empty array
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/stack.js:112:16
     }
 
     toArray() {
-        return this._stackElements.slice();
+        return this._stackElements;
     }
 
killedBy: stack tests .toArray() should be non empty array
statusReason: expected +0 to equal 3

[Killed] BlockStatement
src/stack.js:115:44
         return this._stackElements.slice();
     }
 
-    sortStack(input = this._stackElements) {
-        let tmpStack = [];
-        while (input.length > 0) {
-            let tmp = input.pop();
-            while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
-                input.push(tmpStack[tmpStack.length - 1]);
-                tmpStack.pop();
-            }
-            tmpStack.push(tmp);
-        }
-        return tmpStack;
-    }
+    sortStack(input = this._stackElements) {}
 
     isEmpty() {
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected undefined to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] ArrayDeclaration
src/stack.js:116:24
     }
 
     sortStack(input = this._stackElements) {
-        let tmpStack = [];
+        let tmpStack = ["Stryker was here"];
         while (input.length > 0) {
             let tmp = input.pop();
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [ 'Stryker was here', 1, 1, 1, …(129) ] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] ConditionalExpression
src/stack.js:117:16
 
     sortStack(input = this._stackElements) {
         let tmpStack = [];
-        while (input.length > 0) {
+        while (false) {
             let tmp = input.pop();
             while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] EqualityOperator
src/stack.js:117:16
 
     sortStack(input = this._stackElements) {
         let tmpStack = [];
-        while (input.length > 0) {
+        while (input.length <= 0) {
             let tmp = input.pop();
             while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] ConditionalExpression
src/stack.js:119:20
         let tmpStack = [];
         while (input.length > 0) {
             let tmp = input.pop();
-            while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
+            while (false) {
                 input.push(tmpStack[tmpStack.length - 1]);
                 tmpStack.pop();
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [ Array(83) ] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] EqualityOperator
src/stack.js:119:20
         let tmpStack = [];
         while (input.length > 0) {
             let tmp = input.pop();
-            while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
+            while (tmpStack.length <= 0 && tmpStack[tmpStack.length - 1] > tmp) {
                 input.push(tmpStack[tmpStack.length - 1]);
                 tmpStack.pop();
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [ 23, 92, 98, 31, 3, 34 ] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] ArithmeticOperator
src/stack.js:120:37
         while (input.length > 0) {
             let tmp = input.pop();
             while (tmpStack.length > 0 && tmpStack[tmpStack.length - 1] > tmp) {
-                input.push(tmpStack[tmpStack.length - 1]);
+                input.push(tmpStack[tmpStack.length + 1]);
                 tmpStack.pop();
             }
killedBy: stack tests .sortStack() sorts the stack
statusReason: expected [ 23, 31, undefined, undefined, 3, 34 ] to deeply equal [ 3, 23, 31, 34, 92, 98 ]

[Killed] BlockStatement
src/stack.js:128:15
         return tmpStack;
     }
 
-    isEmpty() {
-        return this._stackElements.length === 0;
-    }
+    isEmpty() {}
 
     size() {
killedBy: stack tests .push(element) should not be empty
statusReason: expected undefined to equal false

[Killed] ConditionalExpression
src/stack.js:129:16
     }
 
     isEmpty() {
-        return this._stackElements.length === 0;
+        return false;
     }
 
killedBy: stack tests .peek() top element
statusReason: expected undefined to equal 3

[Killed] EqualityOperator
src/stack.js:129:16
     }
 
     isEmpty() {
-        return this._stackElements.length === 0;
+        return this._stackElements.length !== 0;
     }
 
killedBy: stack tests .peek() top element
statusReason: expected undefined to equal 3

[Killed] BlockStatement
src/stack.js:132:12
         return this._stackElements.length === 0;
     }
 
-    size() {
-        return this._stackElements.length;
-    }
+    size() {}
 }
 
killedBy: stack tests .push(element) should have size 3
statusReason: expected undefined to equal 3
