[Killed] BlockStatement
src/doublyLinkedList.js:13:17
  * @class
  */
 class DoublyLinkedList {
-  constructor() {
-    this._head = null;
-    this._tail = null;
-    this._count = 0;
-  }
+  constructor() {}
 
   /**
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: Cannot read properties of undefined (reading 'setPrev')

[Killed] BlockStatement
src/doublyLinkedList.js:25:22
    * @param {any} value
    * @returns {DoublyLinkedListNode}
    */
-  insertFirst(value) {
-    const newNode = new DoublyLinkedListNode(value);
-
-    if (this.isEmpty()) {
-      this._head = newNode;
-      this._tail = newNode;
-    } else {
-      this._head.setPrev(newNode);
-      newNode.setNext(this._head);
-      this._head = newNode;
-    }
-    this._count += 1;
-    return newNode;
-  }
+  insertFirst(value) {}
 
   /**
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: expected undefined to be an instance of DoublyLinkedListNode

[Killed] ConditionalExpression
src/doublyLinkedList.js:28:9
   insertFirst(value) {
     const newNode = new DoublyLinkedListNode(value);
 
-    if (this.isEmpty()) {
+    if (false) {
       this._head = newNode;
       this._tail = newNode;
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] BlockStatement
src/doublyLinkedList.js:28:25
   insertFirst(value) {
     const newNode = new DoublyLinkedListNode(value);
 
-    if (this.isEmpty()) {
-      this._head = newNode;
-      this._tail = newNode;
-    } else {
+    if (this.isEmpty()) {} else {
       this._head.setPrev(newNode);
       newNode.setNext(this._head);
killedBy: doublyLinkedList tests .removeFirst() remove first node with a single node list
statusReason: Cannot read properties of null (reading 'getValue')

[Survived] BlockStatement
src/doublyLinkedList.js:31:12
     if (this.isEmpty()) {
       this._head = newNode;
       this._tail = newNode;
-    } else {
-      this._head.setPrev(newNode);
-      newNode.setNext(this._head);
-      this._head = newNode;
-    }
+    } else {}
     this._count += 1;
     return newNode;

[Survived] AssignmentOperator
src/doublyLinkedList.js:36:5
       newNode.setNext(this._head);
       this._head = newNode;
     }
-    this._count += 1;
+    this._count -= 1;
     return newNode;
   }

[Killed] BlockStatement
src/doublyLinkedList.js:46:21
    * @param {any} value
    * @returns {DoublyLinkedListNode}
    */
-  insertLast(value) {
-    const newNode = new DoublyLinkedListNode(value);
-    if (this.isEmpty()) {
-      this._head = newNode;
-      this._tail = newNode;
-    } else {
-      newNode.setPrev(this._tail);
-      this._tail.setNext(newNode);
-      this._tail = newNode;
-    }
-    this._count += 1;
-    return newNode;
-  }
+  insertLast(value) {}
 
   /**
killedBy: doublyLinkedList tests .insertLast(value) add a node to the end of the list
statusReason: expected undefined to be an instance of DoublyLinkedListNode

[Killed] ConditionalExpression
src/doublyLinkedList.js:48:9
    */
   insertLast(value) {
     const newNode = new DoublyLinkedListNode(value);
-    if (this.isEmpty()) {
+    if (false) {
       this._head = newNode;
       this._tail = newNode;
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] BlockStatement
src/doublyLinkedList.js:48:25
    */
   insertLast(value) {
     const newNode = new DoublyLinkedListNode(value);
-    if (this.isEmpty()) {
-      this._head = newNode;
-      this._tail = newNode;
-    } else {
+    if (this.isEmpty()) {} else {
       newNode.setPrev(this._tail);
       this._tail.setNext(newNode);
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:51:12
     if (this.isEmpty()) {
       this._head = newNode;
       this._tail = newNode;
-    } else {
-      newNode.setPrev(this._tail);
-      this._tail.setNext(newNode);
-      this._tail = newNode;
-    }
+    } else {}
     this._count += 1;
     return newNode;
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 4 ] to deeply equal [ 5, 3, 4 ]

[Killed] LogicalOperator
src/doublyLinkedList.js:69:7
    */
   insertAt(position, value) {
     if (
-      Number.isNaN(+position)
-      || position < 0 || position > this._count
+      Number.isNaN(+position) && position < 0 || position > this._count
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: doublyLinkedList tests .insertAt(position, value) throws error position is not a valid number
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/doublyLinkedList.js:69:7
    */
   insertAt(position, value) {
     if (
-      Number.isNaN(+position)
-      || position < 0 || position > this._count
+      true
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] EqualityOperator
src/doublyLinkedList.js:70:10
   insertAt(position, value) {
     if (
       Number.isNaN(+position)
-      || position < 0 || position > this._count
+      || position >= 0 || position > this._count
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] ConditionalExpression
src/doublyLinkedList.js:70:10
   insertAt(position, value) {
     if (
       Number.isNaN(+position)
-      || position < 0 || position > this._count
+      || false || position > this._count
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: doublyLinkedList tests .insertAt(position, value) throws error position is not a valid number
statusReason: expected [Function] to throw Error

[Killed] BlockStatement
src/doublyLinkedList.js:71:7
     if (
       Number.isNaN(+position)
       || position < 0 || position > this._count
-    ) {
-      throw new Error('.insertAt expects a position num <= linked list size');
-    }
+    ) {}
 
     if (position === 0) {
killedBy: doublyLinkedList tests .insertAt(position, value) throws error position is not a valid number
statusReason: expected [Function] to throw Error

[NoCoverage] BlockStatement
src/doublyLinkedList.js:75:25
       throw new Error('.insertAt expects a position num <= linked list size');
     }
 
-    if (position === 0) {
-      return this.insertFirst(value);
-    }
+    if (position === 0) {}
 
     if (position === this._count) {

[Survived] ConditionalExpression
src/doublyLinkedList.js:79:9
       return this.insertFirst(value);
     }
 
-    if (position === this._count) {
+    if (false) {
       return this.insertLast(value);
     }

[Survived] EqualityOperator
src/doublyLinkedList.js:79:9
       return this.insertFirst(value);
     }
 
-    if (position === this._count) {
+    if (position !== this._count) {
       return this.insertLast(value);
     }

[Timeout] BlockStatement
src/doublyLinkedList.js:85:40
 
     let currentPosition = 1;
     let prev = this._head;
-    while (currentPosition < position) {
-      currentPosition += 1;
-      prev = prev.getNext();
-    }
+    while (currentPosition < position) {}
 
     const newNode = new DoublyLinkedListNode(value);

[Survived] AssignmentOperator
src/doublyLinkedList.js:95:5
     newNode.setPrev(prev);
     newNode.getNext().setPrev(newNode);
     newNode.getPrev().setNext(newNode);
-    this._count += 1;
+    this._count -= 1;
     return newNode;
   }

[Killed] BlockStatement
src/doublyLinkedList.js:104:17
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  removeFirst() {
-    if (this.isEmpty()) return null;
-
-    const removedNode = this._head;
-    if (this._head.hasNext()) {
-      this._head = this._head.getNext();
-      this._head.setPrev(null);
-    } else {
-      this._head = null;
-      this._tail = null;
-    }
-    this._count -= 1;
-    return removedNode.setNext(null);
-  }
+  removeFirst() {}
 
   /**
killedBy: doublyLinkedList tests .removeFirst() remove the first node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:108:9
     if (this.isEmpty()) return null;
 
     const removedNode = this._head;
-    if (this._head.hasNext()) {
+    if (false) {
       this._head = this._head.getNext();
       this._head.setPrev(null);
killedBy: doublyLinkedList tests .removeFirst() remove the first node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:108:9
     if (this.isEmpty()) return null;
 
     const removedNode = this._head;
-    if (this._head.hasNext()) {
+    if (true) {
       this._head = this._head.getNext();
       this._head.setPrev(null);
killedBy: doublyLinkedList tests .removeFirst() remove the first node
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/doublyLinkedList.js:111:12
     if (this._head.hasNext()) {
       this._head = this._head.getNext();
       this._head.setPrev(null);
-    } else {
-      this._head = null;
-      this._tail = null;
-    }
+    } else {}
     this._count -= 1;
     return removedNode.setNext(null);
killedBy: doublyLinkedList tests .removeFirst() remove first node with a single node list
statusReason: expected false to equal true

[Killed] BlockStatement
src/doublyLinkedList.js:124:16
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  removeLast() {
-    if (this.isEmpty()) return null;
-
-    const removedNode = this._tail;
-    if (this._tail.hasPrev()) {
-      this._tail = this._tail.getPrev();
-      this._tail.setNext(null);
-    } else {
-      this._head = null;
-      this._tail = null;
-    }
-    this._count -= 1;
-    return removedNode.setPrev(null);
-  }
+  removeLast() {}
 
   /**
killedBy: doublyLinkedList tests .removeLast() remove the last node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:128:9
     if (this.isEmpty()) return null;
 
     const removedNode = this._tail;
-    if (this._tail.hasPrev()) {
+    if (false) {
       this._tail = this._tail.getPrev();
       this._tail.setNext(null);
killedBy: doublyLinkedList tests .removeLast() remove the last node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:128:31
     if (this.isEmpty()) return null;
 
     const removedNode = this._tail;
-    if (this._tail.hasPrev()) {
-      this._tail = this._tail.getPrev();
-      this._tail.setNext(null);
-    } else {
+    if (this._tail.hasPrev()) {} else {
       this._head = null;
       this._tail = null;
killedBy: doublyLinkedList tests .removeLast() remove the last node
statusReason: expected 5 to equal 4

[NoCoverage] BlockStatement
src/doublyLinkedList.js:131:12
     if (this._tail.hasPrev()) {
       this._tail = this._tail.getPrev();
       this._tail.setNext(null);
-    } else {
-      this._head = null;
-      this._tail = null;
-    }
+    } else {}
     this._count -= 1;
     return removedNode.setPrev(null);

[Killed] BlockStatement
src/doublyLinkedList.js:145:22
    * @param {number} position
    * @returns {DoublyLinkedListNode}
    */
-  removeAt(position) {
-    if (
-      Number.isNaN(+position)
-      || position < 0
-      || position >= this._count
-    ) {
-      return null;
-    }
-
-    if (position === 0) {
-      return this.removeFirst();
-    }
-
-    if (position === this._count - 1) {
-      return this.removeLast();
-    }
-
-    let currentPosition = 1;
-    let current = this._head.getNext();
-    while (currentPosition < position) {
-      currentPosition += 1;
-      current = current.getNext();
-    }
-    return this.remove(current);
-  }
+  removeAt(position) {}
 
   /**
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:147:7
    */
   removeAt(position) {
     if (
-      Number.isNaN(+position)
-      || position < 0
-      || position >= this._count
+      true
     ) {
       return null;
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] UnaryOperator
src/doublyLinkedList.js:147:20
    */
   removeAt(position) {
     if (
-      Number.isNaN(+position)
+      Number.isNaN(-position)
       || position < 0
       || position >= this._count
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: expected 7 to equal 2

[Killed] EqualityOperator
src/doublyLinkedList.js:148:10
   removeAt(position) {
     if (
       Number.isNaN(+position)
-      || position < 0
+      || position <= 0
       || position >= this._count
     ) {
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:148:10
   removeAt(position) {
     if (
       Number.isNaN(+position)
-      || position < 0
+      || false
       || position >= this._count
     ) {
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] EqualityOperator
src/doublyLinkedList.js:149:10
     if (
       Number.isNaN(+position)
       || position < 0
-      || position >= this._count
+      || position < this._count
     ) {
       return null;
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:149:10
     if (
       Number.isNaN(+position)
       || position < 0
-      || position >= this._count
+      || false
     ) {
       return null;
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: expected 2 to equal 5

[Killed] BlockStatement
src/doublyLinkedList.js:150:7
       Number.isNaN(+position)
       || position < 0
       || position >= this._count
-    ) {
-      return null;
-    }
+    ) {}
 
     if (position === 0) {
killedBy: doublyLinkedList tests .removeAt(position) does nothing if position is not valid
statusReason: expected DoublyLinkedListNode{ _value: 3, …(2) } to equal null

[Killed] EqualityOperator
src/doublyLinkedList.js:154:9
       return null;
     }
 
-    if (position === 0) {
+    if (position !== 0) {
       return this.removeFirst();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ArithmeticOperator
src/doublyLinkedList.js:158:22
       return this.removeFirst();
     }
 
-    if (position === this._count - 1) {
+    if (position === this._count + 1) {
       return this.removeLast();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] ConditionalExpression
src/doublyLinkedList.js:158:9
       return this.removeFirst();
     }
 
-    if (position === this._count - 1) {
+    if (false) {
       return this.removeLast();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: expected 3 to equal 2

[Killed] EqualityOperator
src/doublyLinkedList.js:164:12
 
     let currentPosition = 1;
     let current = this._head.getNext();
-    while (currentPosition < position) {
+    while (currentPosition <= position) {
       currentPosition += 1;
       current = current.getNext();
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:164:12
 
     let currentPosition = 1;
     let current = this._head.getNext();
-    while (currentPosition < position) {
+    while (false) {
       currentPosition += 1;
       current = current.getNext();
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:177:16
    * @param {DoublyLinkedListNode} node
    * @returns {DoublyLinkedListNode}
    */
-  remove(node) {
-    if (node && !(node instanceof DoublyLinkedListNode)) {
-      throw new Error('remove: expects a DoublyLinkedListNode node');
-    }
-
-    if (!node) {
-      return null;
-    }
-
-    if (!node.hasPrev()) {
-      return this.removeFirst();
-    }
-
-    if (!node.hasNext()) {
-      return this.removeLast();
-    }
-
-    node.getPrev().setNext(node.getNext());
-    node.getNext().setPrev(node.getPrev());
-    this._count -= 1;
-    return node.setPrev(null).setNext(null);
-  }
+  remove(node) {}
 
   /**
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:178:9
    * @returns {DoublyLinkedListNode}
    */
   remove(node) {
-    if (node && !(node instanceof DoublyLinkedListNode)) {
+    if (false) {
       throw new Error('remove: expects a DoublyLinkedListNode node');
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] ConditionalExpression
src/doublyLinkedList.js:178:9
    * @returns {DoublyLinkedListNode}
    */
   remove(node) {
-    if (node && !(node instanceof DoublyLinkedListNode)) {
+    if (true) {
       throw new Error('remove: expects a DoublyLinkedListNode node');
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:182:9
       throw new Error('remove: expects a DoublyLinkedListNode node');
     }
 
-    if (!node) {
+    if (true) {
       return null;
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:186:9
       return null;
     }
 
-    if (!node.hasPrev()) {
+    if (false) {
       return this.removeFirst();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:186:9
       return null;
     }
 
-    if (!node.hasPrev()) {
+    if (true) {
       return this.removeFirst();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:190:9
       return this.removeFirst();
     }
 
-    if (!node.hasNext()) {
+    if (true) {
       return this.removeLast();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:190:9
       return this.removeFirst();
     }
 
-    if (!node.hasNext()) {
+    if (false) {
       return this.removeLast();
     }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] AssignmentOperator
src/doublyLinkedList.js:196:5
 
     node.getPrev().setNext(node.getNext());
     node.getNext().setPrev(node.getPrev());
-    this._count -= 1;
+    this._count += 1;
     return node.setPrev(null).setNext(null);
   }
killedBy: doublyLinkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:206:18
    * @param {function} cb
    * @returns {number} number of removed nodes
    */
-  removeEach(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.removeEach(cb) expects a callback');
-    }
-
-    let removedCount = 0;
-    let position = 0;
-    let current = this._head;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current, position)) {
-        const next = current.getNext();
-        this.remove(current);
-        removedCount += 1;
-        current = next;
-      } else {
-        current = current.getNext();
-      }
-      position += 1;
-    }
-    return removedCount;
-  }
+  removeEach(cb) {}
 
   /**
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected undefined to deeply equal 2

[Killed] ConditionalExpression
src/doublyLinkedList.js:207:9
    * @returns {number} number of removed nodes
    */
   removeEach(cb) {
-    if (typeof cb !== 'function') {
+    if (false) {
       throw new Error('.removeEach(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 1 to deeply equal 2

[Killed] ConditionalExpression
src/doublyLinkedList.js:207:9
    * @returns {number} number of removed nodes
    */
   removeEach(cb) {
-    if (typeof cb !== 'function') {
+    if (true) {
       throw new Error('.removeEach(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: .removeEach(cb) expects a callback

[Killed] ConditionalExpression
src/doublyLinkedList.js:214:12
     let removedCount = 0;
     let position = 0;
     let current = this._head;
-    while (current instanceof DoublyLinkedListNode) {
+    while (false) {
       if (cb(current, position)) {
         const next = current.getNext();
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected +0 to deeply equal 2

[Timeout] BlockStatement
src/doublyLinkedList.js:214:53
     let removedCount = 0;
     let position = 0;
     let current = this._head;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current, position)) {
-        const next = current.getNext();
-        this.remove(current);
-        removedCount += 1;
-        current = next;
-      } else {
-        current = current.getNext();
-      }
-      position += 1;
-    }
+    while (current instanceof DoublyLinkedListNode) {}
     return removedCount;
   }

[Killed] ConditionalExpression
src/doublyLinkedList.js:215:11
     let position = 0;
     let current = this._head;
     while (current instanceof DoublyLinkedListNode) {
-      if (cb(current, position)) {
+      if (false) {
         const next = current.getNext();
         this.remove(current);
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected +0 to deeply equal 2

[Killed] ConditionalExpression
src/doublyLinkedList.js:215:11
     let position = 0;
     let current = this._head;
     while (current instanceof DoublyLinkedListNode) {
-      if (cb(current, position)) {
+      if (true) {
         const next = current.getNext();
         this.remove(current);
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 1 to deeply equal 2

[Killed] AssignmentOperator
src/doublyLinkedList.js:218:9
       if (cb(current, position)) {
         const next = current.getNext();
         this.remove(current);
-        removedCount += 1;
+        removedCount -= 1;
         current = next;
       } else {
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected -3 to deeply equal 2

[Killed] BlockStatement
src/doublyLinkedList.js:220:14
         this.remove(current);
         removedCount += 1;
         current = next;
-      } else {
-        current = current.getNext();
-      }
+      } else {}
       position += 1;
     }
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 5 to deeply equal 2

[Killed] AssignmentOperator
src/doublyLinkedList.js:223:7
       } else {
         current = current.getNext();
       }
-      position += 1;
+      position -= 1;
     }
     return removedCount;
killedBy: doublyLinkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BlockStatement
src/doublyLinkedList.js:233:15
    * @public
    * @param {function} cb
    */
-  forEach(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.forEach(cb) expects a callback');
-    }
-
-    let current = this._head;
-    let position = 0;
-    while (current instanceof DoublyLinkedListNode) {
-      cb(current, position);
-      position += 1;
-      current = current.getNext();
-    }
-  }
+  forEach(cb) {}
 
   /**
killedBy: doublyLinkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:234:35
    * @param {function} cb
    */
   forEach(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.forEach(cb) expects a callback');
-    }
+    if (typeof cb !== 'function') {}
 
     let current = this._head;
killedBy: doublyLinkedList tests .forEach(cb) throws an error if cb is not a function
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/doublyLinkedList.js:234:9
    * @param {function} cb
    */
   forEach(cb) {
-    if (typeof cb !== 'function') {
+    if (true) {
       throw new Error('.forEach(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .forEach(cb) traverse the linked list
statusReason: .forEach(cb) expects a callback

[Killed] StringLiteral
src/doublyLinkedList.js:235:23
    */
   forEach(cb) {
     if (typeof cb !== 'function') {
-      throw new Error('.forEach(cb) expects a callback');
+      throw new Error("");
     }
 
killedBy: doublyLinkedList tests .forEach(cb) throws an error if cb is not a function
statusReason: expected Error to have property 'message' of '.forEach(cb) expects a callback', but got ''

[Killed] ConditionalExpression
src/doublyLinkedList.js:240:12
 
     let current = this._head;
     let position = 0;
-    while (current instanceof DoublyLinkedListNode) {
+    while (false) {
       cb(current, position);
       position += 1;
killedBy: doublyLinkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:240:53
 
     let current = this._head;
     let position = 0;
-    while (current instanceof DoublyLinkedListNode) {
-      cb(current, position);
-      position += 1;
-      current = current.getNext();
-    }
+    while (current instanceof DoublyLinkedListNode) {}
   }
 
killedBy: doublyLinkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] AssignmentOperator
src/doublyLinkedList.js:242:7
     let position = 0;
     while (current instanceof DoublyLinkedListNode) {
       cb(current, position);
-      position += 1;
+      position -= 1;
       current = current.getNext();
     }
killedBy: doublyLinkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:252:22
    * @public
    * @param {function} cb
    */
-  forEachReverse(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.forEachReverse(cb) expects a callback');
-    }
-
-    let current = this._tail;
-    let position = this._count - 1;
-    while (current instanceof DoublyLinkedListNode) {
-      cb(current, position);
-      position -= 1;
-      current = current.getPrev();
-    }
-  }
+  forEachReverse(cb) {}
 
   /**
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 4, 3, 5, 1, 2 ]

[Killed] ConditionalExpression
src/doublyLinkedList.js:253:9
    * @param {function} cb
    */
   forEachReverse(cb) {
-    if (typeof cb !== 'function') {
+    if (false) {
       throw new Error('.forEachReverse(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [ 4 ] to deeply equal [ 4, 3, 5, 1, 2 ]

[Killed] ConditionalExpression
src/doublyLinkedList.js:253:9
    * @param {function} cb
    */
   forEachReverse(cb) {
-    if (typeof cb !== 'function') {
+    if (true) {
       throw new Error('.forEachReverse(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: .forEachReverse(cb) expects a callback

[Killed] ArithmeticOperator
src/doublyLinkedList.js:258:20
     }
 
     let current = this._tail;
-    let position = this._count - 1;
+    let position = this._count + 1;
     while (current instanceof DoublyLinkedListNode) {
       cb(current, position);
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [ 4 ] to deeply equal [ 4, 3, 5, 1, 2 ]
