[Killed] ConditionalExpression
src/doublyLinkedList.js:259:12
 
     let current = this._tail;
     let position = this._count - 1;
-    while (current instanceof DoublyLinkedListNode) {
+    while (false) {
       cb(current, position);
       position -= 1;
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 4, 3, 5, 1, 2 ]

[Killed] BlockStatement
src/doublyLinkedList.js:259:53
 
     let current = this._tail;
     let position = this._count - 1;
-    while (current instanceof DoublyLinkedListNode) {
-      cb(current, position);
-      position -= 1;
-      current = current.getPrev();
-    }
+    while (current instanceof DoublyLinkedListNode) {}
   }
 
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 4, 3, 5, 1, 2 ]

[Killed] AssignmentOperator
src/doublyLinkedList.js:261:7
     let position = this._count - 1;
     while (current instanceof DoublyLinkedListNode) {
       cb(current, position);
-      position -= 1;
+      position += 1;
       current = current.getPrev();
     }
killedBy: doublyLinkedList tests .forEachReverse(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 4, 3, 5, 1, 2 ]

[Killed] BlockStatement
src/doublyLinkedList.js:273:39
    * @param {DoublyLinkedListNode} [startingNode]
    * @returns {DoublyLinkedListNode}
    */
-  find(cb, startingNode = this._head) {
-    if (typeof cb !== 'function') {
-      throw new Error('.find(cb) expects a callback');
-    }
-
-    if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
-      throw new Error('.find(cb) expects to start from a DoublyLinkedListNode');
-    }
-
-    let current = startingNode;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getNext();
-    }
-    return null;
-  }
+  find(cb, startingNode = this._head) {}
 
   /**
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] EqualityOperator
src/doublyLinkedList.js:274:9
    * @returns {DoublyLinkedListNode}
    */
   find(cb, startingNode = this._head) {
-    if (typeof cb !== 'function') {
+    if (typeof cb === 'function') {
       throw new Error('.find(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: .find(cb) expects a callback

[Killed] ConditionalExpression
src/doublyLinkedList.js:274:9
    * @returns {DoublyLinkedListNode}
    */
   find(cb, startingNode = this._head) {
-    if (typeof cb !== 'function') {
+    if (true) {
       throw new Error('.find(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: .find(cb) expects a callback

[Killed] BooleanLiteral
src/doublyLinkedList.js:278:25
       throw new Error('.find(cb) expects a callback');
     }
 
-    if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
+    if (startingNode && startingNode instanceof DoublyLinkedListNode) {
       throw new Error('.find(cb) expects to start from a DoublyLinkedListNode');
     }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] LogicalOperator
src/doublyLinkedList.js:278:9
       throw new Error('.find(cb) expects a callback');
     }
 
-    if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
+    if (startingNode || !(startingNode instanceof DoublyLinkedListNode)) {
       throw new Error('.find(cb) expects to start from a DoublyLinkedListNode');
     }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: .find(cb) expects to start from a DoublyLinkedListNode

[Killed] StringLiteral
src/doublyLinkedList.js:279:23
     }
 
     if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
-      throw new Error('.find(cb) expects to start from a DoublyLinkedListNode');
+      throw new Error("");
     }
 
killedBy: doublyLinkedList tests .find(cb) throws an error if starting node is not valid
statusReason: expected Error to have property 'message' of '.find(cb) expects to start from a Dou…', but got ''

[Killed] BlockStatement
src/doublyLinkedList.js:283:53
     }
 
     let current = startingNode;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getNext();
-    }
+    while (current instanceof DoublyLinkedListNode) {}
     return null;
   }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:283:12
     }
 
     let current = startingNode;
-    while (current instanceof DoublyLinkedListNode) {
+    while (false) {
       if (cb(current)) {
         return current;
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:284:24
 
     let current = startingNode;
     while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
+      if (cb(current)) {}
       current = current.getNext();
     }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:284:11
 
     let current = startingNode;
     while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
+      if (true) {
         return current;
       }
killedBy: doublyLinkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:299:46
    * @param {DoublyLinkedListNode} [startingNode]
    * @returns {DoublyLinkedListNode}
    */
-  findReverse(cb, startingNode = this._tail) {
-    if (typeof cb !== 'function') {
-      throw new Error('.findReverse(cb) expects a callback');
-    }
-
-    if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
-      throw new Error('.findReverse(cb) expects to start from a DoublyLinkedListNode');
-    }
-
-    let current = startingNode;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getPrev();
-    }
-    return null;
-  }
+  findReverse(cb, startingNode = this._tail) {}
 
   /**
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:300:9
    * @returns {DoublyLinkedListNode}
    */
   findReverse(cb, startingNode = this._tail) {
-    if (typeof cb !== 'function') {
+    if (false) {
       throw new Error('.findReverse(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/doublyLinkedList.js:300:9
    * @returns {DoublyLinkedListNode}
    */
   findReverse(cb, startingNode = this._tail) {
-    if (typeof cb !== 'function') {
+    if (typeof cb === 'function') {
       throw new Error('.findReverse(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: .findReverse(cb) expects a callback

[Killed] ConditionalExpression
src/doublyLinkedList.js:304:9
       throw new Error('.findReverse(cb) expects a callback');
     }
 
-    if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
+    if (false) {
       throw new Error('.findReverse(cb) expects to start from a DoublyLinkedListNode');
     }
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[NoCoverage] StringLiteral
src/doublyLinkedList.js:305:23
     }
 
     if (startingNode && !(startingNode instanceof DoublyLinkedListNode)) {
-      throw new Error('.findReverse(cb) expects to start from a DoublyLinkedListNode');
+      throw new Error("");
     }
 

[Killed] BlockStatement
src/doublyLinkedList.js:309:53
     }
 
     let current = startingNode;
-    while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getPrev();
-    }
+    while (current instanceof DoublyLinkedListNode) {}
     return null;
   }
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/doublyLinkedList.js:310:11
 
     let current = startingNode;
     while (current instanceof DoublyLinkedListNode) {
-      if (cb(current)) {
+      if (false) {
         return current;
       }
killedBy: doublyLinkedList tests .findReverse(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:324:14
    * @param {function} cb
    * @returns {LinkedList}
    */
-  filter(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.filter(cb) expects a callback');
-    }
-
-    const result = new DoublyLinkedList();
-    this.forEach((node, position) => {
-      if (!cb(node, position)) return;
-      result.insertLast(node.getValue());
-    });
-    return result;
-  }
+  filter(cb) {}
 
   /**
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: Cannot read properties of undefined (reading 'toArray')

[Killed] EqualityOperator
src/doublyLinkedList.js:325:9
    * @returns {LinkedList}
    */
   filter(cb) {
-    if (typeof cb !== 'function') {
+    if (typeof cb === 'function') {
       throw new Error('.filter(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: .filter(cb) expects a callback

[Killed] ConditionalExpression
src/doublyLinkedList.js:325:9
    * @returns {LinkedList}
    */
   filter(cb) {
-    if (typeof cb !== 'function') {
+    if (false) {
       throw new Error('.filter(cb) expects a callback');
     }
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] StringLiteral
src/doublyLinkedList.js:326:23
    */
   filter(cb) {
     if (typeof cb !== 'function') {
-      throw new Error('.filter(cb) expects a callback');
+      throw new Error("");
     }
 
killedBy: doublyLinkedList tests .filter(cb) throws an error if cb is not a function
statusReason: expected Error to have property 'message' of '.filter(cb) expects a callback', but got ''

[Killed] BlockStatement
src/doublyLinkedList.js:330:38
     }
 
     const result = new DoublyLinkedList();
-    this.forEach((node, position) => {
-      if (!cb(node, position)) return;
-      result.insertLast(node.getValue());
-    });
+    this.forEach((node, position) => {});
     return result;
   }
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] ConditionalExpression
src/doublyLinkedList.js:331:11
 
     const result = new DoublyLinkedList();
     this.forEach((node, position) => {
-      if (!cb(node, position)) return;
+      if (true) return;
       result.insertLast(node.getValue());
     });
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] ConditionalExpression
src/doublyLinkedList.js:331:11
 
     const result = new DoublyLinkedList();
     this.forEach((node, position) => {
-      if (!cb(node, position)) return;
+      if (false) return;
       result.insertLast(node.getValue());
     });
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:342:10
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  head() {
-    return this._head;
-  }
+  head() {}
 
   /**
killedBy: doublyLinkedList tests .head() get the head node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:351:10
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  tail() {
-    return this._tail;
-  }
+  tail() {}
 
   /**
killedBy: doublyLinkedList tests .tail() get the tail node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/doublyLinkedList.js:360:11
    * @public
    * @returns {number}
    */
-  count() {
-    return this._count;
-  }
+  count() {}
 
   /**
killedBy: doublyLinkedList tests .count() get the count of nodes in the list
statusReason: expected undefined to equal 5

[Killed] BlockStatement
src/doublyLinkedList.js:369:13
    * @public
    * @returns {array}
    */
-  toArray() {
-    const result = [];
-    this.forEach((node) => result.push(node.getValue()));
-    return result;
-  }
+  toArray() {}
 
   /**
killedBy: doublyLinkedList tests .toArray() convert the linked list to array in same order
statusReason: expected undefined to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] ArrayDeclaration
src/doublyLinkedList.js:370:20
    * @returns {array}
    */
   toArray() {
-    const result = [];
+    const result = ["Stryker was here"];
     this.forEach((node) => result.push(node.getValue()));
     return result;
killedBy: doublyLinkedList tests .toArray() convert the linked list to array in same order
statusReason: expected [ 'Stryker was here' ] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] ArrowFunction
src/doublyLinkedList.js:371:18
    */
   toArray() {
     const result = [];
-    this.forEach((node) => result.push(node.getValue()));
+    this.forEach(() => undefined);
     return result;
   }
killedBy: doublyLinkedList tests .toArray() convert the linked list to array in same order
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] BlockStatement
src/doublyLinkedList.js:380:13
    * @public
    * @returns {boolean}
    */
-  isEmpty() {
-    return this._head === null;
-  }
+  isEmpty() {}
 
   /**
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] BlockStatement
src/doublyLinkedList.js:388:11
    * Clears the list
    * @public
    */
-  clear() {
-    this._head = null;
-    this._tail = null;
-    this._count = 0;
-  }
+  clear() {}
 
   /**
killedBy: doublyLinkedList tests .clear() clear the linked list
statusReason: expected 18 to equal +0

[Killed] BlockStatement
src/doublyLinkedList.js:401:28
    * @param {array} values
    * @return {DoublyLinkedList}
    */
-  static fromArray(values) {
-    if (!Array.isArray(values)) {
-      throw new Error('cannot create DoublyLinkedList from none-array values');
-    }
-
-    const doublyLinkedList = new DoublyLinkedList();
-    values.forEach((value) => {
-      doublyLinkedList.insertLast(value);
-    });
-    return doublyLinkedList;
-  }
+  static fromArray(values) {}
 }
 
killedBy: doublyLinkedList tests .fromArray(values) create a doubly linked list from an array
statusReason: Cannot read properties of undefined (reading 'toArray')

[Killed] ConditionalExpression
src/doublyLinkedList.js:402:9
    * @return {DoublyLinkedList}
    */
   static fromArray(values) {
-    if (!Array.isArray(values)) {
+    if (true) {
       throw new Error('cannot create DoublyLinkedList from none-array values');
     }
killedBy: doublyLinkedList tests .fromArray(values) create a doubly linked list from an array
statusReason: cannot create DoublyLinkedList from none-array values

[Killed] BooleanLiteral
src/doublyLinkedList.js:402:9
    * @return {DoublyLinkedList}
    */
   static fromArray(values) {
-    if (!Array.isArray(values)) {
+    if (Array.isArray(values)) {
       throw new Error('cannot create DoublyLinkedList from none-array values');
     }
killedBy: doublyLinkedList tests .fromArray(values) create a doubly linked list from an array
statusReason: cannot create DoublyLinkedList from none-array values

[Killed] BlockStatement
src/doublyLinkedList.js:407:31
     }
 
     const doublyLinkedList = new DoublyLinkedList();
-    values.forEach((value) => {
-      doublyLinkedList.insertLast(value);
-    });
+    values.forEach((value) => {});
     return doublyLinkedList;
   }
killedBy: doublyLinkedList tests .fromArray(values) create a doubly linked list from an array
statusReason: expected [] to deeply equal [ 1, 2, 3, 4, 5 ]
