[Killed] BlockStatement
src/doublyLinkedListNode.js:17:34
    * @param {DoublyLinkedListNode} [prev]
    * @param {DoublyLinkedListNode} [next]
    */
-  constructor(value, prev, next) {
-    this._value = value;
-    this.setPrev(prev);
-    this.setNext(next);
-  }
+  constructor(value, prev, next) {}
 
   /**
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[NoCoverage] BlockStatement
src/doublyLinkedListNode.js:27:19
    * @public
    * @param {object} value
    */
-  setValue(value) {
-    this._value = value;
-    return this;
-  }
+  setValue(value) {}
 
   /**

[Killed] BlockStatement
src/doublyLinkedListNode.js:36:14
    * @public
    * @returns {object}
    */
-  getValue() {
-    return this._value;
-  }
+  getValue() {}
 
   /**
killedBy: doublyLinkedList tests .head() get the head node
statusReason: expected undefined to equal 2

[Killed] BlockStatement
src/doublyLinkedListNode.js:45:17
    * @param {DoublyLinkedListNode} [next]
    * @returns {DoublyLinkedListNode}
    */
-  setNext(next) {
-    if (next && !(next instanceof DoublyLinkedListNode)) {
-      throw new Error('setNext expects a DoublyLinkedListNode or null');
-    }
-    this._next = next || null;
-    return this;
-  }
+  setNext(next) {}
 
   /**
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of undefined (reading 'getNext')

[Killed] LogicalOperator
src/doublyLinkedListNode.js:46:9
    * @returns {DoublyLinkedListNode}
    */
   setNext(next) {
-    if (next && !(next instanceof DoublyLinkedListNode)) {
+    if (next || !(next instanceof DoublyLinkedListNode)) {
       throw new Error('setNext expects a DoublyLinkedListNode or null');
     }
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: setNext expects a DoublyLinkedListNode or null

[Killed] ConditionalExpression
src/doublyLinkedListNode.js:46:9
    * @returns {DoublyLinkedListNode}
    */
   setNext(next) {
-    if (next && !(next instanceof DoublyLinkedListNode)) {
+    if (true) {
       throw new Error('setNext expects a DoublyLinkedListNode or null');
     }
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: setNext expects a DoublyLinkedListNode or null

[NoCoverage] StringLiteral
src/doublyLinkedListNode.js:47:23
    */
   setNext(next) {
     if (next && !(next instanceof DoublyLinkedListNode)) {
-      throw new Error('setNext expects a DoublyLinkedListNode or null');
+      throw new Error("");
     }
     this._next = next || null;

[Killed] LogicalOperator
src/doublyLinkedListNode.js:49:18
     if (next && !(next instanceof DoublyLinkedListNode)) {
       throw new Error('setNext expects a DoublyLinkedListNode or null');
     }
-    this._next = next || null;
+    this._next = next && null;
     return this;
   }
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] BlockStatement
src/doublyLinkedListNode.js:57:13
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  getNext() {
-    return this._next;
-  }
+  getNext() {}
 
   /**
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] BlockStatement
src/doublyLinkedListNode.js:65:13
    * @public
    * @returns {boolean}
    */
-  hasNext() {
-    return this._next instanceof DoublyLinkedListNode;
-  }
+  hasNext() {}
 
   /**
killedBy: doublyLinkedList tests .removeFirst() remove the first node
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/doublyLinkedListNode.js:74:17
    * @param {DoublyLinkedListNode} [prev]
    * @returns {DoublyLinkedList}
    */
-  setPrev(prev) {
-    if (prev && !(prev instanceof DoublyLinkedListNode)) {
-      throw new Error('setPrev expects a DoublyLinkedListNode or null');
-    }
-    this._prev = prev || null;
-    return this;
-  }
+  setPrev(prev) {}
 
   /**
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of undefined (reading 'setNext')

[Killed] ConditionalExpression
src/doublyLinkedListNode.js:75:9
    * @returns {DoublyLinkedList}
    */
   setPrev(prev) {
-    if (prev && !(prev instanceof DoublyLinkedListNode)) {
+    if (false) {
       throw new Error('setPrev expects a DoublyLinkedListNode or null');
     }
killedBy: doublyLinkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 5 ] to deeply equal [ 5, 3, 4 ]

[Killed] BooleanLiteral
src/doublyLinkedListNode.js:75:17
    * @returns {DoublyLinkedList}
    */
   setPrev(prev) {
-    if (prev && !(prev instanceof DoublyLinkedListNode)) {
+    if (prev && prev instanceof DoublyLinkedListNode) {
       throw new Error('setPrev expects a DoublyLinkedListNode or null');
     }
killedBy: doublyLinkedList tests .insertFirst(value) add a node at the beginning of the list
statusReason: setPrev expects a DoublyLinkedListNode or null

[Killed] LogicalOperator
src/doublyLinkedListNode.js:78:18
     if (prev && !(prev instanceof DoublyLinkedListNode)) {
       throw new Error('setPrev expects a DoublyLinkedListNode or null');
     }
-    this._prev = prev || null;
+    this._prev = prev && null;
     return this;
   }
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] ConditionalExpression
src/doublyLinkedListNode.js:78:18
     if (prev && !(prev instanceof DoublyLinkedListNode)) {
       throw new Error('setPrev expects a DoublyLinkedListNode or null');
     }
-    this._prev = prev || null;
+    this._prev = false;
     return this;
   }
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: newNode.getPrev(...).setNext is not a function

[Killed] BlockStatement
src/doublyLinkedListNode.js:86:13
    * @public
    * @returns {DoublyLinkedListNode}
    */
-  getPrev() {
-    return this._prev;
-  }
+  getPrev() {}
 
   /**
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of undefined (reading 'setNext')

[Killed] BlockStatement
src/doublyLinkedListNode.js:94:13
    * @public
    * @returns {boolean}
    */
-  hasPrev() {
-    return this._prev instanceof DoublyLinkedListNode;
-  }
+  hasPrev() {}
 }
 
killedBy: doublyLinkedList tests .removeLast() remove the last node
statusReason: expected 4 to equal 3
