[Killed] BlockStatement
src/linkedList.js:24:22
    * @param {any} value
    * @returns {LinkedListNode}
    */
-  insertFirst(value) {
-    this._head = new LinkedListNode(value, this._head);
-    this._count += 1;
-    return this._head;
-  }
+  insertFirst(value) {}
 
   /**
killedBy: linkedList tests .insertFirst(value) insert a node at the beginning
statusReason: expected undefined to be an instance of LinkedListNode

[Killed] BlockStatement
src/linkedList.js:37:35
    * @param {LinkedListNode} [startingNode]
    * @returns {LinkedListNode}
    */
-  insertLast(value, startingNode) {
-    if (this.isEmpty()) {
-      return this.insertFirst(value);
-    }
-
-    if (startingNode && !(startingNode instanceof LinkedListNode)) {
-      throw new Error('insertLast expects a LinkedListNode starting node');
-    }
-
-    let current = startingNode || this._head;
-    while (current.hasNext()) {
-      current = current.getNext();
-    }
-
-    current.setNext(new LinkedListNode(value, null));
-    this._count += 1;
-    return current.getNext();
-  }
+  insertLast(value, startingNode) {}
 
   /**
killedBy: linkedList tests .insertLast(value) insert a node to the end 
statusReason: expected undefined to be an instance of LinkedListNode

[Killed] BlockStatement
src/linkedList.js:38:25
    * @returns {LinkedListNode}
    */
   insertLast(value, startingNode) {
-    if (this.isEmpty()) {
-      return this.insertFirst(value);
-    }
+    if (this.isEmpty()) {}
 
     if (startingNode && !(startingNode instanceof LinkedListNode)) {
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] ConditionalExpression
src/linkedList.js:38:9
    * @returns {LinkedListNode}
    */
   insertLast(value, startingNode) {
-    if (this.isEmpty()) {
+    if (true) {
       return this.insertFirst(value);
     }
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 3, 4 ] to deeply equal [ 5, 3, 4 ]

[Killed] ConditionalExpression
src/linkedList.js:42:9
       return this.insertFirst(value);
     }
 
-    if (startingNode && !(startingNode instanceof LinkedListNode)) {
+    if (true) {
       throw new Error('insertLast expects a LinkedListNode starting node');
     }
killedBy: linkedList tests .insertLast(value) insert a node to the end 
statusReason: insertLast expects a LinkedListNode starting node

[Killed] ConditionalExpression
src/linkedList.js:42:9
       return this.insertFirst(value);
     }
 
-    if (startingNode && !(startingNode instanceof LinkedListNode)) {
+    if (false) {
       throw new Error('insertLast expects a LinkedListNode starting node');
     }
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 3, 4 ] to deeply equal [ 5, 3, 4 ]

[Killed] ConditionalExpression
src/linkedList.js:46:19
       throw new Error('insertLast expects a LinkedListNode starting node');
     }
 
-    let current = startingNode || this._head;
+    let current = false;
     while (current.hasNext()) {
       current = current.getNext();
killedBy: linkedList tests .insertLast(value) insert a node to the end 
statusReason: current.hasNext is not a function

[Killed] ConditionalExpression
src/linkedList.js:46:19
       throw new Error('insertLast expects a LinkedListNode starting node');
     }
 
-    let current = startingNode || this._head;
+    let current = true;
     while (current.hasNext()) {
       current = current.getNext();
killedBy: linkedList tests .insertLast(value) insert a node to the end 
statusReason: current.hasNext is not a function

[Killed] ConditionalExpression
src/linkedList.js:47:12
     }
 
     let current = startingNode || this._head;
-    while (current.hasNext()) {
+    while (false) {
       current = current.getNext();
     }
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 4, 4 ] to deeply equal [ 5, 3, 4 ]

[Timeout] BlockStatement
src/linkedList.js:47:31
     }
 
     let current = startingNode || this._head;
-    while (current.hasNext()) {
-      current = current.getNext();
-    }
+    while (current.hasNext()) {}
 
     current.setNext(new LinkedListNode(value, null));

[Killed] BlockStatement
src/linkedList.js:63:29
    * @param {any} value
    * @returns {LinkedListNode}
    */
-  insertAt(position, value) {
-    if (
-      Number.isNaN(+position)
-      || position < 0 || position > this._count
-    ) {
-      throw new Error('.insertAt expects a position num <= linked list size');
-    }
-
-    // head node is at position 0
-    if (position === 0) {
-      return this.insertFirst(value);
-    }
-
-    let currentPosition = 1;
-    let prev = this._head;
-    while (currentPosition < position) {
-      currentPosition += 1;
-      prev = prev.getNext();
-    }
-
-    // add it at a position after the head, between prev & prev.getNext()
-    prev.setNext(new LinkedListNode(value, prev.getNext()));
-    this._count += 1;
-    return prev.getNext();
-  }
+  insertAt(position, value) {}
 
   /**
killedBy: linkedList tests .insertAt(position, value) add a node at a specific position
statusReason: expected undefined to be an instance of LinkedListNode

[Killed] ConditionalExpression
src/linkedList.js:65:7
    */
   insertAt(position, value) {
     if (
-      Number.isNaN(+position)
-      || position < 0 || position > this._count
+      false
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: linkedList tests .insertAt(position, value) throws an error position is not a valid number
statusReason: expected [Function] to throw Error

[Killed] StringLiteral
src/linkedList.js:68:23
       Number.isNaN(+position)
       || position < 0 || position > this._count
     ) {
-      throw new Error('.insertAt expects a position num <= linked list size');
+      throw new Error("");
     }
 
killedBy: linkedList tests .insertAt(position, value) throws an error position is not a valid number
statusReason: expected Error to have property 'message' of '.insertAt expects a position num <= l…', but got ''

[Killed] ConditionalExpression
src/linkedList.js:72:9
     }
 
     // head node is at position 0
-    if (position === 0) {
+    if (false) {
       return this.insertFirst(value);
     }
killedBy: linkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] ConditionalExpression
src/linkedList.js:78:12
 
     let currentPosition = 1;
     let prev = this._head;
-    while (currentPosition < position) {
+    while (false) {
       currentPosition += 1;
       prev = prev.getNext();
killedBy: linkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] BlockStatement
src/linkedList.js:94:17
    * @public
    * @returns {LinkedListNode}
    */
-  removeFirst() {
-    if (this.isEmpty()) return null;
-
-    const removed = this._head;
-    this._head = this._head.getNext();
-    this._count -= 1;
-    return removed.setNext(null);
-  }
+  removeFirst() {}
 
   /**
killedBy: linkedList tests .removeFirst() remove the first node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:108:16
    * @public
    * @returns {LinkedListNode}
    */
-  removeLast() {
-    if (this.isEmpty()) return null;
-
-    let prev = null;
-    let current = this._head;
-    while (current.hasNext()) {
-      prev = current;
-      current = current.getNext();
-    }
-
-    // linked list has 1 node
-    if (prev === null) {
-      return this.removeFirst();
-    }
-
-    prev.setNext(null);
-    this._count -= 1;
-    return current;
-  }
+  removeLast() {}
 
   /**
killedBy: linkedList tests .removeLast() remove the last node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:119:9
     }
 
     // linked list has 1 node
-    if (prev === null) {
+    if (true) {
       return this.removeFirst();
     }
killedBy: linkedList tests .removeLast() remove the last node
statusReason: expected 3 to equal 4

[Killed] BlockStatement
src/linkedList.js:135:35
    * @returns {number} number of removed nodes
    */
   removeEach(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.removeEach(cb) expects a callback');
-    }
+    if (typeof cb !== 'function') {}
 
     let removedCount = 0;
killedBy: linkedList tests .removeEach(cb) throws an error if cb is not a function
statusReason: expected TypeError: cb is not a function to have property 'message' of '.removeEach(cb) expects a callback', but got 'cb is not a function'

[Killed] ConditionalExpression
src/linkedList.js:143:12
     let position = 0;
     let prev = null;
     let current = this._head;
-    while (current instanceof LinkedListNode) {
+    while (false) {
       if (cb(current, position)) {
         if (prev === null) {
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected +0 to equal 2

[Timeout] BlockStatement
src/linkedList.js:143:47
     let position = 0;
     let prev = null;
     let current = this._head;
-    while (current instanceof LinkedListNode) {
-      if (cb(current, position)) {
-        if (prev === null) {
-          this.removeFirst();
-        } else {
-          prev.setNext(prev.getNext().getNext());
-        }
-        this._count -= 1;
-        removedCount += 1;
-      } else {
-        prev = current;
-      }
-      position += 1;
-      current = current.getNext();
-    }
+    while (current instanceof LinkedListNode) {}
     return removedCount;
   }

[Killed] BlockStatement
src/linkedList.js:144:34
     let prev = null;
     let current = this._head;
     while (current instanceof LinkedListNode) {
-      if (cb(current, position)) {
-        if (prev === null) {
-          this.removeFirst();
-        } else {
-          prev.setNext(prev.getNext().getNext());
-        }
-        this._count -= 1;
-        removedCount += 1;
-      } else {
+      if (cb(current, position)) {} else {
         prev = current;
       }
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/linkedList.js:144:11
     let prev = null;
     let current = this._head;
     while (current instanceof LinkedListNode) {
-      if (cb(current, position)) {
+      if (false) {
         if (prev === null) {
           this.removeFirst();
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected +0 to equal 2

[Killed] ConditionalExpression
src/linkedList.js:145:13
     let current = this._head;
     while (current instanceof LinkedListNode) {
       if (cb(current, position)) {
-        if (prev === null) {
+        if (true) {
           this.removeFirst();
         } else {
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/linkedList.js:145:13
     let current = this._head;
     while (current instanceof LinkedListNode) {
       if (cb(current, position)) {
-        if (prev === null) {
+        if (false) {
           this.removeFirst();
         } else {
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] BlockStatement
src/linkedList.js:147:16
       if (cb(current, position)) {
         if (prev === null) {
           this.removeFirst();
-        } else {
-          prev.setNext(prev.getNext().getNext());
-        }
+        } else {}
         this._count -= 1;
         removedCount += 1;
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 1 to equal 2

[Killed] AssignmentOperator
src/linkedList.js:151:9
           prev.setNext(prev.getNext().getNext());
         }
         this._count -= 1;
-        removedCount += 1;
+        removedCount -= 1;
       } else {
         prev = current;
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected -1 to equal 2

[Killed] BlockStatement
src/linkedList.js:152:14
         }
         this._count -= 1;
         removedCount += 1;
-      } else {
-        prev = current;
-      }
+      } else {}
       position += 1;
       current = current.getNext();
killedBy: linkedList tests .removeEach(cb) remove nodes based on a callback
statusReason: expected 1 to equal 2

[Killed] BlockStatement
src/linkedList.js:167:22
    * @param {number} position
    * @returns {LinkedListNode}
    */
-  removeAt(position) {
-    if (
-      Number.isNaN(+position)
-      || position < 0
-      || position >= this._count
-    ) {
-      return null;
-    }
-
-    if (position === 0) {
-      return this.removeFirst();
-    }
-
-    let counter = 1;
-    let prev = this._head;
-    while (counter < position) {
-      counter += 1;
-      prev = prev.getNext();
-    }
-    const removed = prev.getNext();
-    prev.setNext(prev.getNext().getNext());
-    this._count -= 1;
-    return removed.setNext(null);
-  }
+  removeAt(position) {}
 
   /**
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:169:7
    */
   removeAt(position) {
     if (
-      Number.isNaN(+position)
-      || position < 0
-      || position >= this._count
+      false
     ) {
       return null;
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: expected 4 to equal 5

[Killed] ConditionalExpression
src/linkedList.js:169:7
    */
   removeAt(position) {
     if (
-      Number.isNaN(+position)
-      || position < 0
+      false
       || position >= this._count
     ) {
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: expected 9 to equal 2

[Killed] EqualityOperator
src/linkedList.js:170:10
   removeAt(position) {
     if (
       Number.isNaN(+position)
-      || position < 0
+      || position >= 0
       || position >= this._count
     ) {
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] EqualityOperator
src/linkedList.js:171:10
     if (
       Number.isNaN(+position)
       || position < 0
-      || position >= this._count
+      || position > this._count
     ) {
       return null;
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: expected 7 to equal 2

[Killed] ConditionalExpression
src/linkedList.js:182:12
 
     let counter = 1;
     let prev = this._head;
-    while (counter < position) {
+    while (false) {
       counter += 1;
       prev = prev.getNext();
killedBy: linkedList tests .removeAt(position) remove a node
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:197:15
    * @public
    * @param {function} cb
    */
-  forEach(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.forEach(cb) expects a callback');
-    }
-
-    let current = this._head;
-    let position = 0;
-    while (current instanceof LinkedListNode) {
-      cb(current, position);
-      position += 1;
-      current = current.getNext();
-    }
-  }
+  forEach(cb) {}
 
   /**
killedBy: linkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Killed] EqualityOperator
src/linkedList.js:198:9
    * @param {function} cb
    */
   forEach(cb) {
-    if (typeof cb !== 'function') {
+    if (typeof cb === 'function') {
       throw new Error('.forEach(cb) expects a callback');
     }
killedBy: linkedList tests .forEach(cb) traverse the linked list
statusReason: .forEach(cb) expects a callback

[Killed] ConditionalExpression
src/linkedList.js:204:12
 
     let current = this._head;
     let position = 0;
-    while (current instanceof LinkedListNode) {
+    while (false) {
       cb(current, position);
       position += 1;
killedBy: linkedList tests .forEach(cb) traverse the linked list
statusReason: expected [] to deeply equal [ 2, 1, 5, 3, 4 ]

[Timeout] BlockStatement
src/linkedList.js:204:47
 
     let current = this._head;
     let position = 0;
-    while (current instanceof LinkedListNode) {
-      cb(current, position);
-      position += 1;
-      current = current.getNext();
-    }
+    while (current instanceof LinkedListNode) {}
   }
 

[Killed] BlockStatement
src/linkedList.js:218:39
    * @param {DoublyLinkedListNode} [startingNode]
    * @returns {LinkedListNode}
    */
-  find(cb, startingNode = this._head) {
-    if (typeof cb !== 'function') {
-      throw new Error('.find(cb) expects a callback');
-    }
-
-    if (startingNode && !(startingNode instanceof LinkedListNode)) {
-      throw new Error('.find(cb) expects to start from a LinkedListNode');
-    }
-
-    let current = startingNode;
-    while (current instanceof LinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getNext();
-    }
-    return null;
-  }
+  find(cb, startingNode = this._head) {}
 
   /**
killedBy: linkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:223:68
       throw new Error('.find(cb) expects a callback');
     }
 
-    if (startingNode && !(startingNode instanceof LinkedListNode)) {
-      throw new Error('.find(cb) expects to start from a LinkedListNode');
-    }
+    if (startingNode && !(startingNode instanceof LinkedListNode)) {}
 
     let current = startingNode;
killedBy: linkedList tests .find(cb) throws an error if starting node is not valid
statusReason: expected [Function] to throw Error

[Killed] StringLiteral
src/linkedList.js:224:23
     }
 
     if (startingNode && !(startingNode instanceof LinkedListNode)) {
-      throw new Error('.find(cb) expects to start from a LinkedListNode');
+      throw new Error("");
     }
 
killedBy: linkedList tests .find(cb) throws an error if starting node is not valid
statusReason: expected Error to have property 'message' of '.find(cb) expects to start from a Lin…', but got ''

[Killed] ConditionalExpression
src/linkedList.js:228:12
     }
 
     let current = startingNode;
-    while (current instanceof LinkedListNode) {
+    while (false) {
       if (cb(current)) {
         return current;
killedBy: linkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Timeout] BlockStatement
src/linkedList.js:228:47
     }
 
     let current = startingNode;
-    while (current instanceof LinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
-      current = current.getNext();
-    }
+    while (current instanceof LinkedListNode) {}
     return null;
   }

[Killed] BlockStatement
src/linkedList.js:229:24
 
     let current = startingNode;
     while (current instanceof LinkedListNode) {
-      if (cb(current)) {
-        return current;
-      }
+      if (cb(current)) {}
       current = current.getNext();
     }
killedBy: linkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] ConditionalExpression
src/linkedList.js:229:11
 
     let current = startingNode;
     while (current instanceof LinkedListNode) {
-      if (cb(current)) {
+      if (false) {
         return current;
       }
killedBy: linkedList tests .find(cb) finds the first node that fulfills the callback condition
statusReason: Cannot read properties of null (reading 'getValue')

[Killed] BlockStatement
src/linkedList.js:243:14
    * @param {function} cb - callback should return true for required nodes.
    * @returns {LinkedList}
    */
-  filter(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.filter(cb) expects a callback');
-    }
-
-    let last = null;
-    const result = new LinkedList();
-    this.forEach((node, position) => {
-      if (!cb(node, position)) return;
-      last = result.insertLast(node.getValue(), last);
-    });
-    return result;
-  }
+  filter(cb) {}
 
   /**
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: Cannot read properties of undefined (reading 'toArray')

[Killed] BlockStatement
src/linkedList.js:244:35
    * @returns {LinkedList}
    */
   filter(cb) {
-    if (typeof cb !== 'function') {
-      throw new Error('.filter(cb) expects a callback');
-    }
+    if (typeof cb !== 'function') {}
 
     let last = null;
killedBy: linkedList tests .filter(cb) throws an error if cb is not a function
statusReason: expected TypeError: cb is not a function to have property 'message' of '.filter(cb) expects a callback', but got 'cb is not a function'

[Killed] BlockStatement
src/linkedList.js:250:38
 
     let last = null;
     const result = new LinkedList();
-    this.forEach((node, position) => {
-      if (!cb(node, position)) return;
-      last = result.insertLast(node.getValue(), last);
-    });
+    this.forEach((node, position) => {});
     return result;
   }
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] BooleanLiteral
src/linkedList.js:251:11
     let last = null;
     const result = new LinkedList();
     this.forEach((node, position) => {
-      if (!cb(node, position)) return;
+      if (cb(node, position)) return;
       last = result.insertLast(node.getValue(), last);
     });
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] EqualityOperator
src/linkedList.js:292:12
    * @returns {boolean}
    */
   isEmpty() {
-    return this._head === null;
+    return this._head !== null;
   }
 
killedBy: linkedList tests .isEmpty() checks if the list is empty
statusReason: expected true to equal false

[Killed] BlockStatement
src/linkedList.js:299:11
    * Clears the list
    * @public
    */
-  clear() {
-    this._head = null;
-    this._count = 0;
-  }
+  clear() {}
 
   /**
killedBy: linkedList tests .clear() clear the linked list
statusReason: expected 9 to equal +0

[Killed] BlockStatement
src/linkedList.js:311:28
    * @param {array} values
    * @return {LinkedList}
    */
-  static fromArray(values) {
-    if (!Array.isArray(values)) {
-      throw new Error('cannot create LinkedList from none-array values');
-    }
-
-    const linkedList = new LinkedList();
-    let lastInserted = null;
-    values.forEach((value) => {
-      lastInserted = linkedList.insertLast(value, lastInserted);
-    });
-    return linkedList;
-  }
+  static fromArray(values) {}
 }
 
killedBy: linkedList tests .fromArray(values) create a linked list from an array
statusReason: Cannot read properties of undefined (reading 'toArray')

[Killed] BlockStatement
src/linkedList.js:318:31
 
     const linkedList = new LinkedList();
     let lastInserted = null;
-    values.forEach((value) => {
-      lastInserted = linkedList.insertLast(value, lastInserted);
-    });
+    values.forEach((value) => {});
     return linkedList;
   }
killedBy: linkedList tests .fromArray(values) create a linked list from an array
statusReason: expected [] to deeply equal [ 1, 2, 3, 4, 5 ]
