[Killed] BlockStatement
src/linkedListNode.js:14:28
    * @param {any} value
    * @param {LinkedListNode} [next]
    */
-  constructor(value, next) {
-    this._value = value;
-    this.setNext(next);
-  }
+  constructor(value, next) {}
 
   /**
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [] to deeply equal [ 5, 3, 4 ]

[Killed] BlockStatement
src/linkedListNode.js:42:17
    * @param {LinkedListNode} [next]
    * @returns {LinkedListNode}
    */
-  setNext(next) {
-    if (next && !(next instanceof LinkedListNode)) {
-      throw new Error('setNext expects a LinkedListNode or null');
-    }
-    this._next = next || null;
-    return this;
-  }
+  setNext(next) {}
 
   /**
killedBy: linkedList tests .insertLast(value) insert a node to the end 
statusReason: expected undefined to be an instance of LinkedListNode

[Killed] BlockStatement
src/linkedListNode.js:62:13
    * @public
    * @returns {boolean}
    */
-  hasNext() {
-    return this._next instanceof LinkedListNode;
-  }
+  hasNext() {}
 }
 
killedBy: linkedList tests .filter(cb) filters the linked list based on a callback
statusReason: expected [ 4 ] to deeply equal [ 5, 3, 4 ]
