[Killed] BlockStatement
src/queue.js:12:27
      * Creates a queue.
      * @param {array} [elements]
      */
-    constructor(elements) {
-        this._elements = Array.isArray(elements) ? elements : [];
-        this._offset = 0;
-    }
+    constructor(elements) {}
 
     /**
killedBy: Queue unit tests Queue.fromArray(list) creates a queue from an existing array
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/queue.js:22:22
      * @public
      * @param {number|string|object} element
      */
-    enqueue(element) {
-        this._elements.push(element);
-        return this;
-    }
+    enqueue(element) {}
 
     reverse() {
killedBy: Queue unit tests .reverse() reverse the queue
statusReason: expected [] to deeply equal [ 1, 2, 3, 4 ]

[Killed] EqualityOperator
src/queue.js:29:16
 
     reverse() {
         let stack = [];
-        while (this._elements.length > 0) {
+        while (this._elements.length <= 0) {
             stack.push(this._elements[0]);
             this._elements.shift();
killedBy: Queue unit tests .reverse() reverse the queue
statusReason: expected [ 1, 2, 3, 4 ] to deeply equal [ 4, 3, 2, 1 ]

[Killed] BlockStatement
src/queue.js:44:19
      * @public
      * @param {number|string|object} element
      */
-    push(element) {
-        return this.enqueue(element);
-    }
+    push(element) {}
 
     sort() {
killedBy: Queue unit tests .enqueue(element) should enqueue 3 elements to the stack
statusReason: Cannot read properties of undefined (reading 'enqueue')

[Killed] BlockStatement
src/queue.js:57:15
      * @public
      * @returns {number|string|object}
      */
-    dequeue() {
-        if (this.size() === 0) return null;
-
-        const first = this.front();
-        this._offset += 1;
-
-        if (this._offset * 2 < this._elements.length) return first;
-
-        // only remove dequeued elements when reaching half size
-        // to decrease latency of shifting elements.
-        this._elements = this._elements.slice(this._offset);
-        this._offset = 0;
-        return first;
-    }
+    dequeue() {}
 
     /**
killedBy: Queue unit tests .clone() clone a queue
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ConditionalExpression
src/queue.js:58:13
      * @returns {number|string|object}
      */
     dequeue() {
-        if (this.size() === 0) return null;
+        if (false) return null;
 
         const first = this.front();
killedBy: Queue unit tests .clone() clone a queue
statusReason: expected null to equal 45

[Killed] ConditionalExpression
src/queue.js:63:13
         const first = this.front();
         this._offset += 1;
 
-        if (this._offset * 2 < this._elements.length) return first;
+        if (true) return first;
 
         // only remove dequeued elements when reaching half size
killedBy: Queue unit tests .clone() clone a queue
statusReason: Cannot read properties of undefined (reading 'dequeue')

[Killed] MethodExpression
src/queue.js:67:26
 
         // only remove dequeued elements when reaching half size
         // to decrease latency of shifting elements.
-        this._elements = this._elements.slice(this._offset);
+        this._elements = this._elements;
         this._offset = 0;
         return first;
killedBy: Queue unit tests .clone() clone a queue
statusReason: expected null to equal 45

[Killed] BlockStatement
src/queue.js:77:11
      * @public
      * @returns {number|string|object}
      */
-    pop() {
-        return this.dequeue();
-    }
+    pop() {}
 
     /**
killedBy: Queue unit tests dequeue() should dequeue all elements
statusReason: expected null to equal 8

[Killed] BlockStatement
src/queue.js:86:13
      * @public
      * @returns {number|string|object}
      */
-    front() {
-        return this.size() > 0 ? this._elements[this._offset] : null;
-    }
+    front() {}
 
     reverseFirstK(k) {
killedBy: Queue unit tests Queue.fromArray(list) creates a queue from an existing array
statusReason: expected undefined to equal 1

[Killed] EqualityOperator
src/queue.js:87:16
      * @returns {number|string|object}
      */
     front() {
-        return this.size() > 0 ? this._elements[this._offset] : null;
+        return this.size() >= 0 ? this._elements[this._offset] : null;
     }
 
killedBy: Queue unit tests .front() should peek the front element
statusReason: Cannot read properties of undefined (reading 'front')

[Killed] LogicalOperator
src/queue.js:91:13
     }
 
     reverseFirstK(k) {
-        if (this._elements.length == 0 || k > this._elements.length)
+        if (this._elements.length == 0 && k > this._elements.length)
             return false;
         if (k <= 0) return false;
killedBy: Queue unit tests .reverseFirstK() should return false for k > number of elements
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/queue.js:91:43
     }
 
     reverseFirstK(k) {
-        if (this._elements.length == 0 || k > this._elements.length)
+        if (this._elements.length == 0 || false)
             return false;
         if (k <= 0) return false;
killedBy: Queue unit tests .reverseFirstK() should return false for k > number of elements
statusReason: expected true to equal false

[Killed] EqualityOperator
src/queue.js:101:25
         while (Stack.length > 0) {
             this._elements.push(Stack.pop());
         }
-        for (let i = 0; i < this._elements.length - k; i++) {
+        for (let i = 0; i <= this._elements.length - k; i++) {
             this._elements.push(this._elements.shift());
         }
killedBy: Queue unit tests .reverseFirstK() reverse in groups of k and return true
statusReason: expected [ Array(10) ] to deeply equal [ Array(10) ]

[Killed] BlockStatement
src/queue.js:112:12
      * @public
      * @returns {number|string|object}
      */
-    back() {
-        return this.size() > 0
-            ? this._elements[this._elements.length - 1]
-            : null;
-    }
+    back() {}
 
     /**
killedBy: Queue unit tests .back() should peek the back element
statusReason: expected undefined to equal 45

[Killed] EqualityOperator
src/queue.js:113:16
      * @returns {number|string|object}
      */
     back() {
-        return this.size() > 0
+        return this.size() >= 0
             ? this._elements[this._elements.length - 1]
             : null;
killedBy: Queue unit tests .back() should peek the back element
statusReason: expected undefined to equal 45

[Killed] BlockStatement
src/queue.js:123:12
      * @public
      * @returns {number}
      */
-    size() {
-        return this._elements.length - this._offset;
-    }
+    size() {}
 
     /**
killedBy: Queue unit tests Queue.fromArray(list) creates a queue from an existing array
statusReason: expected null to equal 1

[Killed] BlockStatement
src/queue.js:132:15
      * @public
      * @returns {boolean}
      */
-    isEmpty() {
-        return this.size() === 0;
-    }
+    isEmpty() {}
 
     /**
killedBy: Queue unit tests .isEmpty() should not be empty
statusReason: expected undefined to equal false

[Killed] EqualityOperator
src/queue.js:133:16
      * @returns {boolean}
      */
     isEmpty() {
-        return this.size() === 0;
+        return this.size() !== 0;
     }
 
killedBy: Queue unit tests .clear() should clear the queue
statusReason: expected false to equal true

[Killed] BlockStatement
src/queue.js:141:15
      * @public
      * @returns {array}
      */
-    toArray() {
-        return this._elements.slice(this._offset);
-    }
+    toArray() {}
 
     interleave() {
killedBy: Queue unit tests .reverse() reverse the queue
statusReason: expected undefined to deeply equal [ 1, 2, 3, 4 ]

[Killed] ConditionalExpression
src/queue.js:146:13
     }
 
     interleave() {
-        if (this._elements.length % 2 != 0) return false;
+        if (true) return false;
         let temp = [];
         let halfSize = this._elements.length / 2;
killedBy: Queue unit tests .interleave() should interleave elements of odd and even positions
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/queue.js:146:52
     }
 
     interleave() {
-        if (this._elements.length % 2 != 0) return false;
+        if (this._elements.length % 2 != 0) return true;
         let temp = [];
         let halfSize = this._elements.length / 2;
killedBy: Queue unit tests .interleave() should abort operations on an odd length queue
statusReason: expected true to equal false

[Killed] EqualityOperator
src/queue.js:153:16
             temp.push(this._elements[0]);
             this._elements.shift();
         }
-        while (temp.length != 0) {
+        while (temp.length == 0) {
             this._elements.push(temp[0]);
             this._elements.push(this._elements[0]);
killedBy: Queue unit tests .interleave() should interleave elements of odd and even positions
statusReason: expected false to equal true

[Killed] BlockStatement
src/queue.js:167:13
      * @public
      * @return {Queue}
      */
-    clone() {
-        return new Queue(this._elements.slice(this._offset));
-    }
+    clone() {}
 
     clear() {
killedBy: Queue unit tests .clone() clone a queue
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/queue.js:183:32
      * @param {array} elements
      * @return {Queue}
      */
-    static fromArray(elements) {
-        return new Queue(elements);
-    }
+    static fromArray(elements) {}
 }
 
killedBy: Queue unit tests Queue.fromArray(list) creates a queue from an existing array
statusReason: Cannot read properties of undefined (reading 'front')
