[Killed] ConditionalExpression
src/doublyLinkedList.js:70:26
   insertAt(position, value) {
     if (
       Number.isNaN(+position)
-      || position < 0 || position > this._count
+      || position < 0 || false
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: doublyLinkedList tests .insertAt(position, value) add a node at a specific position
statusReason: Cannot read properties of null (reading 'getNext')
