[Killed] EqualityOperator
src/linkedList.js:66:26
   insertAt(position, value) {
     if (
       Number.isNaN(+position)
-      || position < 0 || position > this._count
+      || position < 0 || position <= this._count
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: linkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Killed] EqualityOperator
src/linkedList.js:66:10
   insertAt(position, value) {
     if (
       Number.isNaN(+position)
-      || position < 0 || position > this._count
+      || position <= 0 || position > this._count
     ) {
       throw new Error('.insertAt expects a position num <= linked list size');
killedBy: linkedList tests .insertAt(position, value) add a node at a specific position
statusReason: .insertAt expects a position num <= linked list size

[Survived] EqualityOperator
src/linkedList.js:72:9
     }
 
     // head node is at position 0
-    if (position === 0) {
+    if (position !== 0) {
       return this.insertFirst(value);
     }

[Killed] ConditionalExpression
src/linkedList.js:119:9
     }
 
     // linked list has 1 node
-    if (prev === null) {
+    if (false) {
       return this.removeFirst();
     }
killedBy: linkedList tests .removeLast() remove the last node
statusReason: expected 5 to equal 4
