[Killed] BlockStatement
src/queue.js:22:34
             stack.push(this._elements[0]);
             this._elements.shift();
         }
-        while (stack.length > 0) {
-            this._elements.push(stack[stack.length - 1]);
-            stack.pop();
-        }
+        while (stack.length > 0) {}
     }
 
killedBy: Queue tests .reverse() reverse the queue
statusReason: expected [ 4, 3, 2, 1, 'Stryker was here' ] to deeply equal [ 1, 2, 3, 4 ]
